{"recipes":[{"id":52768,"name":"Apple Frangipan Tart","category":"Dessert","region":"British","instructions":["Preheat the oven to 200C/180C Fan/Gas 6.\r","Put the biscuits in a large re-sealable freezer bag and bash with a rolling pin into fine crumbs. Melt the butter in a small pan, then add the biscuit crumbs and stir until coated with butter. Tip into the tart tin and, using the back of a spoon, press over the base and sides of the tin to give an even layer. Chill in the fridge while you make the filling.\r","Cream together the butter and sugar until light and fluffy. You can do this in a food processor if you have one. Process for 2-3 minutes. Mix in the eggs, then add the ground almonds and almond extract and blend until well combined.\r","Peel the apples, and cut thin slices of apple. Do this at the last minute to prevent the apple going brown. Arrange the slices over the biscuit base. Spread the frangipane filling evenly on top. Level the surface and sprinkle with the flaked almonds.\r","Bake for 20-25 minutes until golden-brown and set.\r","Remove from the oven and leave to cool for 15 minutes. Remove the sides of the tin. An easy way to do this is to stand the tin on a can of beans and push down gently on the edges of the tin.\r","Transfer the tart, with the tin base attached, to a serving plate. Serve warm with cream, crème fraiche or ice cream."],"picture":"https://www.themealdb.com/images/media/meals/wxywrq1468235067.jpg","tags":["Tart","Baking","Fruity"]},{"id":52893,"name":"Apple & Blackberry Crumble","category":"Dessert","region":"British","instructions":["Heat oven to 190C/170C fan/gas 5. Tip the flour and sugar into a large bowl. Add the butter, then rub into the flour using your fingertips to make a light breadcrumb texture. Do not overwork it or the crumble will become heavy. Sprinkle the mixture evenly over a baking sheet and bake for 15 mins or until lightly coloured.\r","Meanwhile, for the compote, peel, core and cut the apples into 2cm dice. Put the butter and sugar in a medium saucepan and melt together over a medium heat. Cook for 3 mins until the mixture turns to a light caramel. Stir in the apples and cook for 3 mins. Add the blackberries and cinnamon, and cook for 3 mins more. Cover, remove from the heat, then leave for 2-3 mins to continue cooking in the warmth of the pan.\r","To serve, spoon the warm fruit into an ovenproof gratin dish, top with the crumble mix, then reheat in the oven for 5-10 mins. Serve with vanilla ice cream."],"picture":"https://www.themealdb.com/images/media/meals/xvsurr1511719182.jpg","tags":["Pudding"]},{"id":53049,"name":"Apam balik","category":"Dessert","region":"Malaysian","instructions":["Mix milk, oil and egg together. Sift flour, baking powder and salt into the mixture. Stir well until all ingredients are combined evenly.\r","\r","Spread some batter onto the pan. Spread a thin layer of batter to the side of the pan. Cover the pan for 30-60 seconds until small air bubbles appear.\r","\r","Add butter, cream corn, crushed peanuts and sugar onto the pancake. Fold the pancake into half once the bottom surface is browned.\r","\r","Cut into wedges and best eaten when it is warm."],"picture":"https://www.themealdb.com/images/media/meals/adxcbq1619787919.jpg","tags":[]},{"id":53050,"name":"Ayam Percik","category":"Chicken","region":"Malaysian","instructions":["In a blender, add the ingredients for the spice paste and blend until smooth.\r","Over medium heat, pour the spice paste in a skillet or pan and fry for 10 minutes until fragrant. Add water or oil 1 tablespoon at a time if the paste becomes too dry. Don't burn the paste. Lower the fire slightly if needed.\r","Add the cloves, cardamom, tamarind pulp, coconut milk, water, sugar and salt. Turn the heat up and bring the mixture to boil. Turn the heat to medium low and simmer for 10 minutes. Stir occasionally. It will reduce slightly. This is the marinade/sauce, so taste and adjust seasoning if necessary. Don't worry if it's slightly bitter. It will go away when roasting.\r","When the marinade/sauce has cooled, pour everything over the chicken and marinate overnight to two days.\r","Preheat the oven to 425 F.\r","Remove the chicken from the marinade. Spoon the marinade onto a greased (or aluminum lined) baking sheet. Lay the chicken on top of the sauce (make sure the chicken covers the sauce and the sauce isn't exposed or it'll burn) and spread the remaining marinade on the chicken. Roast for 35-45 minutes or until internal temp of the thickest part of chicken is at least 175 F.\r","Let chicken rest for 5 minutes. Brush the chicken with some of the oil. Serve chicken with the sauce over steamed rice (or coconut rice)."],"picture":"https://www.themealdb.com/images/media/meals/020z181619788503.jpg","tags":[]},{"id":52767,"name":"Bakewell tart","category":"Dessert","region":"British","instructions":["To make the pastry, measure the flour into a bowl and rub in the butter with your fingertips until the mixture resembles fine breadcrumbs. Add the water, mixing to form a soft dough.\r","Roll out the dough on a lightly floured work surface and use to line a 20cm/8in flan tin. Leave in the fridge to chill for 30 minutes.\r","Preheat the oven to 200C/400F/Gas 6 (180C fan).\r","Line the pastry case with foil and fill with baking beans. Bake blind for about 15 minutes, then remove the beans and foil and cook for a further five minutes to dry out the base.\r","For the filing, spread the base of the flan generously with raspberry jam.\r","Melt the butter in a pan, take off the heat and then stir in the sugar. Add ground almonds, egg and almond extract. Pour into the flan tin and sprinkle over the flaked almonds.\r","Bake for about 35 minutes. If the almonds seem to be browning too quickly, cover the tart loosely with foil to prevent them burning."],"picture":"https://www.themealdb.com/images/media/meals/wyrqqq1468233628.jpg","tags":["Tart","Baking","Alcoholic"]},{"id":52792,"name":"Bread and Butter Pudding","category":"Dessert","region":"British","instructions":["Grease a 1 litre/2 pint pie dish with butter.\r","Cut the crusts off the bread. Spread each slice with on one side with butter, then cut into triangles.\r","Arrange a layer of bread, buttered-side up, in the bottom of the dish, then add a layer of sultanas. Sprinkle with a little cinnamon, then repeat the layers of bread and sultanas, sprinkling with cinnamon, until you have used up all of the bread. Finish with a layer of bread, then set aside.\r","Gently warm the milk and cream in a pan over a low heat to scalding point. Don't let it boil.\r","Crack the eggs into a bowl, add three quarters of the sugar and lightly whisk until pale.\r","Add the warm milk and cream mixture and stir well, then strain the custard into a bowl.\r","Pour the custard over the prepared bread layers and sprinkle with nutmeg and the remaining sugar and leave to stand for 30 minutes.\r","Preheat the oven to 180C/355F/Gas 4.\r","Place the dish into the oven and bake for 30-40 minutes, or until the custard has set and the top is golden-brown."],"picture":"https://www.themealdb.com/images/media/meals/xqwwpy1483908697.jpg","tags":["Pudding","Brunch"]},{"id":52803,"name":"Beef Wellington","category":"Beef","region":"British","instructions":["Put the mushrooms into a food processor with some seasoning and pulse to a rough paste. Scrape the paste into a pan and cook over a high heat for about 10 mins, tossing frequently, to cook out the moisture from the mushrooms. Spread out on a plate to cool.\r","Heat in a frying pan and add a little olive oil. Season the beef and sear in the hot pan for 30 secs only on each side. (You don't want to cook it at this stage, just colour it). Remove the beef from the pan and leave to cool, then brush all over with the mustard.\r","Lay a sheet of cling film on a work surface and arrange the Parma ham slices on it, in slightly overlapping rows. With a palette knife, spread the mushroom paste over the ham, then place the seared beef fillet in the middle. Keeping a tight hold of the cling film from the edge, neatly roll the Parma ham and mushrooms around the beef to form a tight barrel shape. Twist the ends of the cling film to secure. Chill for 15-20 mins to allow the beef to set and keep its shape.\r","Roll out the puff pastry on a floured surface to a large rectangle, the thickness of a £1 coin. Remove the cling film from the beef, then lay in the centre. Brush the surrounding pastry with egg yolk. Fold the ends over, the wrap the pastry around the beef, cutting off any excess. Turn over, so the seam is underneath, and place on a baking sheet. Brush over all the pastry with egg and chill for about 15 mins to let the pastry rest.\r","Heat the oven to 200C, 400F, gas 6.\r","Lightly score the pastry at 1cm intervals and glaze again with beaten egg yolk. Bake for 20 minutes, then lower the oven setting to 180C, 350F, gas 4 and cook for another 15 mins. Allow to rest for 10-15 mins before slicing and serving with the side dishes of your choice. The beef should still be pink in the centre when you serve it."],"picture":"https://www.themealdb.com/images/media/meals/vvpprx1487325699.jpg","tags":["Meat","Stew"]},{"id":52807,"name":"Baingan Bharta","category":"Vegetarian","region":"Indian","instructions":["Rinse the baingan (eggplant or aubergine) in water. Pat dry with a kitchen napkin. Apply some oil all over and\r","keep it for roasting on an open flame. You can also grill the baingan or roast in the oven. But then you won't get\r","the smoky flavor of the baingan. Keep the eggplant turning after a 2 to 3 minutes on the flame, so that its evenly\r","cooked. You could also embed some garlic cloves in the baingan and then roast it.\r","2. Roast the aubergine till its completely cooked and tender. With a knife check the doneness. The knife should slid\r","easily in aubergines without any resistance. Remove the baingan and immerse in a bowl of water till it cools\r","down.\r","3. You can also do the dhungar technique of infusing charcoal smoky flavor in the baingan. This is an optional step.\r","Use natural charcoal for this method. Heat a small piece of charcoal on flame till it becomes smoking hot and red.\r","4. Make small cuts on the baingan with a knife. Place the red hot charcoal in the same plate where the roasted\r","aubergine is kept. Add a few drops of oil on the charcoal. The charcoal would begin to smoke.\r","5. As soon as smoke begins to release from the charcoal, cover the entire plate tightly with a large bowl. Allow the\r","charcoal smoke to get infused for 1 to 2 minutes. The more you do, the more smoky the baingan bharta will\r","become. I just keep for a minute. Alternatively, you can also do this dhungar method once the baingan bharta is\r","cooked, just like the way we do for Dal Tadka.\r","6. Peel the skin from the roasted and smoked eggplant.\r","7. Chop the cooked eggplant finely or you can even mash it.\r","8. In a kadai or pan, heat oil. Then add finely chopped onions and garlic.\r","9. Saute the onions till translucent. Don't brown them.\r","10. Add chopped green chilies and saute for a minute.\r","11. Add the chopped tomatoes and mix it well.\r","12. Bhuno (saute) the tomatoes till the oil starts separating from the mixture.\r","13. Now add the red chili powder. Stir and mix well.\r","14. Add the chopped cooked baingan.\r","15. Stir and mix the chopped baingan very well with the onion­tomato masala mixture.\r","16. Season with salt. Stir and saute for some more 4 to 5 minutes more.\r","17. Finally stir in the coriander leaves with the baingan bharta or garnish it with them. Serve Baingan Bharta with\r","phulkas, rotis or chapatis. It goes well even with bread, toasted or grilled bread and plain rice or jeera rice."],"picture":"https://www.themealdb.com/images/media/meals/urtpqw1487341253.jpg","tags":["Spicy","Bun","Calorific"]},{"id":52812,"name":"Beef Brisket Pot Roast","category":"Beef","region":"American","instructions":["1 Prepare the brisket for cooking: On one side of the brisket there should be a layer of fat, which you want. If there are any large chunks of fat, cut them off and discard them. Large pieces of fat will not be able to render out completely.\r","Using a sharp knife, score the fat in parallel lines, about 3/4-inch apart. Slice through the fat, not the beef. Repeat in the opposite direction to make a cross-hatch pattern.\r","Salt the brisket well and let it sit at room temperature for 30 minutes.\r"," \r","2 Sear the brisket: You'll need an oven-proof, thick-bottomed pot with a cover, or Dutch oven, that is just wide enough to hold the brisket roast with a little room for the onions.\r","Pat the brisket dry and place it, fatty side down, into the pot and place it on medium high heat. Cook for 5-8 minutes, lightly sizzling, until the fat side is nicely browned. (If the roast seems to be cooking too fast, turn the heat down to medium. You want a steady sizzle, not a raging sear.)\r","Turn the brisket over and cook for a few minutes more to brown the other side.\r","\r","3 Sauté the onions and garlic: When the brisket has browned, remove it from the pot and set aside. There should be a couple tablespoons of fat rendered in the pot, if not, add some olive oil.\r","Add the chopped onions and increase the heat to high. Sprinkle a little salt on the onions. Sauté, stirring often, until the onions are lightly browned, 5-8 minutes. Stir in the garlic and cook 1-2 more minutes.\r"," \r","4 Return brisket to pot, add herbs, stock, bring to simmer, cover, cook in oven: Preheat the oven to 300°F. Use kitchen twine to tie together the bay leaves, rosemary and thyme.\r","Move the onions and garlic to the sides of the pot and nestle the brisket inside. Add the beef stock and the tied-up herbs. Bring the stock to a boil on the stovetop.\r","Cover the pot, place the pot in the 300°F oven and cook for 3 hours. Carefully flip the brisket every hour so it cooks evenly.\r"," \r","5 Add carrots, continue to cook: After 3 hours, add the carrots. Cover the pot and cook for 1 hour more, or until the carrots are cooked through and the brisket is falling-apart tender.\r","6 Remove brisket to cutting board, tent with foil: When the brisket is falling-apart tender, take the pot out of the oven and remove the brisket to a cutting board. Cover it with foil. Pull out and discard the herbs.\r","7 Make sauce (optional): At this point you have two options. You can serve as is, or you can make a sauce with the drippings and some of the onions. If you serve as is, skip this step.\r","To make a sauce, remove the carrots and half of the onions, set aside and cover them with foil. Pour the ingredients that are remaining into the pot into a blender, and purée until smooth. If you want, add 1 tablespoon of mustard to the mix. Put into a small pot and keep warm.\r","8 Slice the meat across the grain: Notice the lines of the muscle fibers of the roast. This is the \"grain\" of the meat. Slice the meat perpendicular to these lines, or across the grain (cutting this way further tenderizes the meat), in 1/4-inch to 1/2-inch slices.\r","Serve with the onions, carrots and gravy. Serve with mashed, roasted or boiled potatoes, egg noodles or polenta."],"picture":"https://www.themealdb.com/images/media/meals/ursuup1487348423.jpg","tags":["Meat"]},{"id":52824,"name":"Beef Sunday Roast","category":"Beef","region":"British","instructions":["Cook the Broccoli and Carrots in a pan of boiling water until tender.\r","\r","Roast the Beef and Potatoes in the oven for 45mins, the potatoes may need to be checked regularly to not overcook.\r","\r","To make the Yorkshire puddings:\r","Heat oven to 230C/fan 210C/gas 8. Drizzle a little sunflower oil evenly into 2 x 4-hole Yorkshire pudding tins or a 12-hole non-stick muffin tin and place in the oven to heat through\r","To make the batter, tip 140g plain flour into a bowl and beat in four eggs until smooth. Gradually add 200ml milk and carry on beating until the mix is completely lump-free. Season with salt and pepper. Pour the batter into a jug, then remove the hot tins from the oven. Carefully and evenly pour the batter into the holes. Place the tins back in the oven and leave undisturbed for 20-25 mins until the puddings have puffed up and browned. Serve immediately.\r","\r","Plate up and add the Gravy as desired."],"picture":"https://www.themealdb.com/images/media/meals/ssrrrs1503664277.jpg","tags":["MainMeal"]},{"id":52826,"name":"Braised Beef Chilli","category":"Beef","region":"Mexican","instructions":["Preheat the oven to 120C/225F/gas mark 1.\r","\r","Take the meat out of the fridge to de-chill. Pulse the onions and garlic in a food processor until finely chopped. Heat 2 tbsp olive oil in a large casserole and sear the meat on all sides until golden.\r","\r","Set to one side and add another small slug of oil to brown the chorizo. Remove and add the onion and garlic, spices, herbs and chillies then cook until soft in the chorizo oil. Season with salt and pepper and add the vinegar, tomatoes, ketchup and sugar.\r","\r","Put all the meat back into the pot with 400ml water (or red wine if you prefer), bring up to a simmer and cook, covered, in the low oven.\r","\r","After 2 hours, check the meat and add the beans. Cook for a further hour and just before serving, pull the meat apart with a pair of forks."],"picture":"https://www.themealdb.com/images/media/meals/uuqvwu1504629254.jpg","tags":[]},{"id":52834,"name":"Beef stroganoff","category":"Beef","region":"Russian","instructions":["Heat the olive oil in a non-stick frying pan then add the sliced onion and cook on a medium heat until completely softened, so around 15 mins, adding a little splash of water if they start to stick at all. Crush in the garlic and cook for a 2-3 mins further, then add the butter. Once the butter is foaming a little, add the mushrooms and cook for around 5 mins until completely softened. Season everything well, then tip onto a plate.\r","Tip the flour into a bowl with a big pinch of salt and pepper, then toss the steak in the seasoned flour. Add the steak pieces to the pan, splashing in a little oil if the pan looks particularly dry, and fry for 3-4 mins, until well coloured. Tip the onions and mushrooms back into the pan. Whisk the crème fraîche, mustard and beef stock together, then pour into the pan. Cook over a medium heat for around 5 mins. Scatter with parsley, then serve with pappardelle or rice."],"picture":"https://www.themealdb.com/images/media/meals/svprys1511176755.jpg","tags":[]},{"id":52842,"name":"Broccoli & Stilton soup","category":"Starter","region":"British","instructions":["Heat the rapeseed oil in a large saucepan and then add the onions. Cook on a medium heat until soft. Add a splash of water if the onions start to catch.\r","\r","Add the celery, leek, potato and a knob of butter. Stir until melted, then cover with a lid. Allow to sweat for 5 minutes. Remove the lid.\r","\r","Pour in the stock and add any chunky bits of broccoli stalk. Cook for 10 – 15 minutes until all the vegetables are soft.\r","\r","Add the rest of the broccoli and cook for a further 5 minutes. Carefully transfer to a blender and blitz until smooth. Stir in the stilton, allowing a few lumps to remain. Season with black pepper and serve."],"picture":"https://www.themealdb.com/images/media/meals/tvvxpv1511191952.jpg","tags":[]},{"id":52848,"name":"Bean & Sausage Hotpot","category":"Miscellaneous","region":"British","instructions":["In a large casserole, fry the sausages until brown all over – about 10 mins.\r","\r","Add the tomato sauce, stirring well, then stir in the beans, treacle or sugar and mustard. Bring to the simmer, cover and cook for 30 mins. Great served with crusty bread or rice."],"picture":"https://www.themealdb.com/images/media/meals/vxuyrx1511302687.jpg","tags":[]},{"id":52855,"name":"Banana Pancakes","category":"Dessert","region":"American","instructions":["In a bowl, mash the banana with a fork until it resembles a thick purée. Stir in the eggs, baking powder and vanilla.\r","Heat a large non-stick frying pan or pancake pan over a medium heat and brush with half the oil. Using half the batter, spoon two pancakes into the pan, cook for 1-2 mins each side, then tip onto a plate. Repeat the process with the remaining oil and batter. Top the pancakes with the pecans and raspberries."],"picture":"https://www.themealdb.com/images/media/meals/sywswr1511383814.jpg","tags":["Breakfast","Desert","Sweet"]},{"id":52873,"name":"Beef Dumpling Stew","category":"Beef","region":"British","instructions":["Preheat the oven to 180C/350F/Gas 4.\r","\r","For the beef stew, heat the oil and butter in an ovenproof casserole and fry the beef until browned on all sides.\r","\r","Sprinkle over the flour and cook for a further 2-3 minutes.\r","\r","Add the garlic and all the vegetables and fry for 1-2 minutes.\r","\r","Stir in the wine, stock and herbs, then add the Worcestershire sauce and balsamic vinegar, to taste. Season with salt and freshly ground black pepper.\r","\r","Cover with a lid, transfer to the oven and cook for about two hours, or until the meat is tender.\r","\r","For the dumplings, sift the flour, baking powder and salt into a bowl.\r","Add the suet and enough water to form a thick dough.\r","\r","With floured hands, roll spoonfuls of the dough into small balls.\r","\r","After two hours, remove the lid from the stew and place the balls on top of the stew. Cover, return to the oven and cook for a further 20 minutes, or until the dumplings have swollen and are tender. (If you prefer your dumplings with a golden top, leave the lid off when returning to the oven.)\r","\r","To serve, place a spoonful of mashed potato onto each of four serving plates and top with the stew and dumplings. Sprinkle with chopped parsley."],"picture":"https://www.themealdb.com/images/media/meals/uyqrrv1511553350.jpg","tags":["Stew","Baking"]},{"id":52874,"name":"Beef and Mustard Pie","category":"Beef","region":"British","instructions":["Preheat the oven to 150C/300F/Gas 2.\r","Toss the beef and flour together in a bowl with some salt and black pepper.\r","Heat a large casserole until hot, add half of the rapeseed oil and enough of the beef to just cover the bottom of the casserole.\r","Fry until browned on each side, then remove and set aside. Repeat with the remaining oil and beef.\r","Return the beef to the pan, add the wine and cook until the volume of liquid has reduced by half, then add the stock, onion, carrots, thyme and mustard, and season well with salt and pepper.\r","Cover with a lid and place in the oven for two hours.\r","Remove from the oven, check the seasoning and set aside to cool. Remove the thyme.\r","When the beef is cool and you're ready to assemble the pie, preheat the oven to 200C/400F/Gas 6.\r","Transfer the beef to a pie dish, brush the rim with the beaten egg yolks and lay the pastry over the top. Brush the top of the pastry with more beaten egg.\r","Trim the pastry so there is just enough excess to crimp the edges, then place in the oven and bake for 30 minutes, or until the pastry is golden-brown and cooked through.\r","For the green beans, bring a saucepan of salted water to the boil, add the beans and cook for 4-5 minutes, or until just tender.\r","Drain and toss with the butter, then season with black pepper.\r","To serve, place a large spoonful of pie onto each plate with some green beans alongside."],"picture":"https://www.themealdb.com/images/media/meals/sytuqu1511553755.jpg","tags":["Meat","Pie"]},{"id":52878,"name":"Beef and Oyster pie","category":"Beef","region":"British","instructions":["Season the beef cubes with salt and black pepper. Heat a tablespoon of oil in the frying pan and fry the meat over a high heat. Do this in three batches so that you don’t overcrowd the pan, transferring the meat to a large flameproof casserole dish once it is browned all over. Add extra oil if the pan seems dry.\r","In the same pan, add another tablespoon of oil and cook the shallots for 4-5 minutes, then add the garlic and fry for 30 seconds. Add the bacon and fry until slightly browned. Transfer the onion and bacon mixture to the casserole dish and add the herbs.\r","Preheat the oven to 180C/350F/Gas 4.\r","Pour the stout into the frying pan and bring to the boil, stirring to lift any stuck-on browned bits from the bottom of the pan. Pour the stout over the beef in the casserole dish and add the stock. Cover the casserole and place it in the oven for 1½-2 hours, or until the beef is tender and the sauce is reduced.\r","Skim off any surface fat, taste and add salt and pepper if necessary, then stir in the cornflour paste. Put the casserole dish on the hob – don’t forget that it will be hot – and simmer for 1-2 minutes, stirring, until thickened. Leave to cool.\r","Increase the oven to 200C/400F/Gas 6. To make the pastry, put the flour and salt in a very large bowl. Grate the butter and stir it into the flour in three batches. Gradually add 325ml/11fl oz cold water – you may not need it all – and stir with a round-bladed knife until the mixture just comes together. Knead the pastry lightly into a ball on a lightly floured surface and set aside 250g/9oz for the pie lid.\r","Roll the rest of the pastry out until about 2cm/¾in larger than the dish you’re using. Line the dish with the pastry then pile in the filling, tucking the oysters in as well. Brush the edge of the pastry with beaten egg.\r","Roll the remaining pastry until slightly larger than your dish and gently lift over the filling, pressing the edges firmly to seal, then trim with a sharp knife. Brush with beaten egg to glaze. Put the dish on a baking tray and bake for 25-30 minutes, or until the pastry is golden-brown and the filling is bubbling."],"picture":"https://www.themealdb.com/images/media/meals/wrssvt1511556563.jpg","tags":["Pie"]},{"id":52891,"name":"Blackberry Fool","category":"Dessert","region":"British","instructions":["For the biscuits, preheat the oven to 200C/180C (fan)/Gas 6 and line two large baking trays with baking parchment. Scatter the nuts over a baking tray and roast in the oven for 6-8 minutes, or until golden-brown. Watch them carefully so that they don’t have a chance to burn. Remove from the oven, tip onto a board and leave to cool.\r","Put the butter and sugar in a large bowl and beat with a wooden spoon until light and creamy. Roughly chop the cooled nuts and add to the creamed butter and sugar, along with the lemon zest, flour and baking powder. Stir well until the mixture comes together and forms a ball – you may need to use your hands.\r","Divide the biscuit dough into 24 even pieces and roll into small balls. Place the balls the prepared baking trays, spaced well apart to allow for spreading.\r","Press the biscuits to flatten to around 1cm/½in thick. Bake the biscuits, one tray at a time, for 12 minutes or until very pale golden-brown. Leave to cool on the trays. They will be very soft when you take them out of the oven, but will crisp as they cool.\r","Store in an airtight tin and eat within five days.\r","For the fool, rinse the blackberries in a colander to wash away any dust or dirt. Put the blackberries in a non-stick saucepan and sprinkle over the caster sugar.\r","Stir in the lemon juice and heat gently for two minutes, or until the blackberries begin to soften and release their juices. Remove and reserve 12 blackberries for decoration and continue cooking the rest.\r","Simmer the blackberries very gently for 15 minutes, stirring regularly until very soft and squidgy. Remove from the heat and press the berries and juice through a sieve over a bowl, using the bottom of a ladle to help you extract as much of the purée as possible. Leave the purée to cool and discard the seeds. You should end up with around 325ml/11fl oz of purée.\r","Put the cream and yoghurt in a large bowl and whip with an electric whisk until soft peaks form when the whisk is removed from the bowl – the acidity of the fruit will thicken the cream further, so don’t take it too far.\r","When the purée is completely cold, adjust the sweetness to taste by adding more sugar if needed. Pour it into the bowl with the whipped cream and yoghurt and stir just once or twice until very lightly combined.\r","Spoon the blackberry fool into individual wide, glass dishes – or one large, single bowl. It should look quite marbled, so don’t over-stir it. Scatter a few tiny mint leaves on top and decorate with the reserved blackberries. Sprinkle with a little sugar if you like and serve with the hazelnut biscuits."],"picture":"https://www.themealdb.com/images/media/meals/rpvptu1511641092.jpg","tags":["Desert","Summer","Fruity","Dairy"]},{"id":52894,"name":"Battenberg Cake","category":"Dessert","region":"British","instructions":["Heat oven to 180C/160C fan/gas 4 and line the base and sides of a 20cm square tin with baking parchment (the easiest way is to cross 2 x 20cm-long strips over the base). To make the almond sponge, put the butter, sugar, flour, ground almonds, baking powder, eggs, vanilla and almond extract in a large bowl. Beat with an electric whisk until the mix comes together smoothly. Scrape into the tin, spreading to the corners, and bake for 25-30 mins – when you poke in a skewer, it should come out clean. Cool in the tin for 10 mins, then transfer to a wire rack to finish cooling while you make the second sponge.\r","For the pink sponge, line the tin as above. Mix all the ingredients together as above, but don’t add the almond extract. Fold in some pink food colouring. Then scrape it all into the tin and bake as before. Cool.\r","To assemble, heat the jam in a small pan until runny, then sieve. Barely trim two opposite edges from the almond sponge, then well trim a third edge. Roughly measure the height of the sponge, then cutting from the well-trimmed edge, use a ruler to help you cut 4 slices each the same width as the sponge height. Discard or nibble leftover sponge. Repeat with pink cake.\r","Take 2 x almond slices and 2 x pink slices and trim so they are all the same length. Roll out one marzipan block on a surface lightly dusted with icing sugar to just over 20cm wide, then keep rolling lengthways until the marzipan is roughly 0.5cm thick. Brush with apricot jam, then lay a pink and an almond slice side by side at one end of the marzipan, brushing jam in between to stick sponges, and leaving 4cm clear marzipan at the end. Brush more jam on top of the sponges, then sandwich remaining 2 slices on top, alternating colours to give a checkerboard effect. Trim the marzipan to the length of the cakes.\r","Carefully lift up the marzipan and smooth over the cake with your hands, but leave a small marzipan fold along the bottom edge before you stick it to the first side. Trim opposite side to match size of fold, then crimp edges using fingers and thumb (or, more simply, press with prongs of fork). If you like, mark the 10 slices using the prongs of a fork.\r","Assemble second Battenberg and keep in an airtight box or well wrapped in cling film for up to 3 days. Can be frozen for up to a month."],"picture":"https://www.themealdb.com/images/media/meals/ywwrsp1511720277.jpg","tags":["Cake","Sweet"]},{"id":52904,"name":"Beef Bourguignon","category":"Beef","region":"French","instructions":["Heat a large casserole pan and add 1 tbsp goose fat. Season the beef and fry until golden brown, about 3-5 mins, then turn over and fry the other side until the meat is browned all over, adding more fat if necessary. Do this in 2-3 batches, transferring the meat to a colander set over a bowl when browned.\r","In the same pan, fry the bacon, shallots or pearl onions, mushrooms, garlic and bouquet garni until lightly browned. Mix in the tomato purée and cook for a few mins, stirring into the mixture. This enriches the bourguignon and makes a great base for the stew. Then return the beef and any drained juices to the pan and stir through.\r","Pour over the wine and about 100ml water so the meat bobs up from the liquid, but isn’t completely covered. Bring to the boil and use a spoon to scrape the caramelised cooking juices from the bottom of the pan – this will give the stew more flavour.\r","Heat oven to 150C/fan 130C/gas 2. Make a cartouche: tear off a square of foil slightly larger than the casserole, arrange it in the pan so it covers the top of the stew and trim away any excess foil. Then cook for 3 hrs. If the sauce looks watery, remove the beef and veg with a slotted spoon, and set aside. Cook the sauce over a high heat for a few mins until the sauce has thickened a little, then return the beef and vegetables to the pan.\r","To make the celeriac mash, peel the celeriac and cut into cubes. Heat the olive oil in a large frying pan. Tip in the celeriac and fry for 5 mins until it turns golden. Season well with salt and pepper. Stir in the rosemary, thyme, bay and cardamom pods, then pour over 200ml water, enough to nearly cover the celeriac. Turn the heat to low, partially cover the pan and leave to simmer for 25-30 mins.\r","After 25-30 mins, the celeriac should be soft and most of the water will have evaporated. Drain away any remaining water, then remove the herb sprigs, bay and cardamom pods. Lightly crush with a potato masher, then finish with a glug of olive oil and season to taste. Spoon the beef bourguignon into serving bowls and place a large spoonful of the celeriac mash on top. Garnish with one of the bay leaves, if you like."],"picture":"https://www.themealdb.com/images/media/meals/vtqxtu1511784197.jpg","tags":[]},{"id":52913,"name":"Brie wrapped in prosciutto & brioche","category":"Side","region":"French","instructions":["Mix the flour, 1 tsp salt, caster sugar, yeast, milk and eggs together in a mixer using the dough attachment for 5 mins until the dough is smooth. Add the butter and mix for a further 4 mins on medium speed. Scrape the dough bowl and mix again for 1 min. Place the dough in a container, cover with cling film and leave in the fridge for at least 6 hrs before using.\r","Wrap the Brie in the prosciutto and set aside. Turn out the dough onto a lightly floured surface. Roll into a 25cm circle. Place the wrapped Brie in the middle of the circle and fold the edges in neatly. Put the parcel onto a baking tray lined with baking parchment and brush with beaten egg. Chill in the fridge for 30 mins, then brush again with beaten egg and chill for a further 30 mins. Leave to rise for 1 hr at room temperature. Heat oven to 200C/180C fan/gas 6, then bake for 22 mins. Serve warm."],"picture":"https://www.themealdb.com/images/media/meals/qqpwsy1511796276.jpg","tags":["SideDish","Treat","Baking"]},{"id":52914,"name":"Boulangère Potatoes","category":"Side","region":"French","instructions":["Heat oven to 200C/fan 180C/gas 6. Fry the onions and thyme sprigs in the oil until softened and lightly coloured (about 5 mins).\r","Spread a layer of potatoes over the base of a 1.5-litre oiled gratin dish. Sprinkle over a few onions (see picture, above) and continue layering, finishing with a layer of potatoes. Pour over the stock and bake for 50-60 mins until the potatoes are cooked and the top is golden and crisp."],"picture":"https://www.themealdb.com/images/media/meals/qywups1511796761.jpg","tags":["SideDish"]},{"id":52928,"name":"BeaverTails","category":"Dessert","region":"Canadian","instructions":["In the bowl of a stand mixer, add warm water, a big pinch of sugar and yeast. Allow to sit until frothy.\r","Into the same bowl, add 1/2 cup sugar, warm milk, melted butter, eggs and salt, and whisk until combined.\r","Place a dough hook on the mixer, add the flour with the machine on, until a smooth but slightly sticky dough forms.\r","Place dough in a bowl, cover with plastic wrap, and allow to proof for 1 1/2 hours.\r","Cut dough into 12 pieces, and roll out into long oval-like shapes about 1/4 inch thick that resemble a beaver’s tail.\r","In a large, deep pot, heat oil to 350 degrees. Gently place beavertail dough into hot oil and cook for 30 to 45 seconds on each side until golden brown.\r","Drain on paper towels, and garnish as desired. Toss in cinnamon sugar, in white sugar with a squeeze of lemon, or with a generous slathering of Nutella and a handful of toasted almonds. Enjoy!"],"picture":"https://www.themealdb.com/images/media/meals/ryppsv1511815505.jpg","tags":["Treat","Pudding","Speciality"]},{"id":52940,"name":"Brown Stew Chicken","category":"Chicken","region":"Jamaican","instructions":["Squeeze lime over chicken and rub well. Drain off excess lime juice.\r","Combine tomato, scallion, onion, garlic, pepper, thyme, pimento and soy sauce in a large bowl with the chicken pieces. Cover and marinate at least one hour.\r","Heat oil in a dutch pot or large saucepan. Shake off the seasonings as you remove each piece of chicken from the marinade. Reserve the marinade for sauce.\r","Lightly brown the chicken a few pieces at a time in very hot oil. Place browned chicken pieces on a plate to rest while you brown the remaining pieces.\r","Drain off excess oil and return the chicken to the pan. Pour the marinade over the chicken and add the carrots. Stir and cook over medium heat for 10 minutes.\r","Mix flour and coconut milk and add to stew, stirring constantly. Turn heat down to minimum and cook another 20 minutes or until tender."],"picture":"https://www.themealdb.com/images/media/meals/sypxpx1515365095.jpg","tags":["Stew"]},{"id":52952,"name":"Beef Lo Mein","category":"Beef","region":"Chinese","instructions":["STEP 1 - MARINATING THE BEEF\r","In a bowl, add the beef, salt, 1 pinch white pepper, 1 Teaspoon sesame seed oil, 1/2 egg, corn starch,1 Tablespoon of oil and mix together.\r","STEP 2 - BOILING THE THE NOODLES\r","In a 6 qt pot add your noodles to boiling water until the noodles are submerged and boil on high heat for 10 seconds. After your noodles is done boiling strain and cool with cold water.\r","STEP 3 - STIR FRY\r","Add 2 Tablespoons of oil, beef and cook on high heat untill beef is medium cooked.\r","Set the cooked beef aside\r","In a wok add 2 Tablespoon of oil, onions, minced garlic, minced ginger, bean sprouts, mushrooms, peapods and 1.5 cups of water or until the vegetables are submerged in water.\r","Add the noodles to wok\r","To make the sauce, add oyster sauce, 1 pinch white pepper, 1 teaspoon sesame seed oil, sugar, and 1 Teaspoon of soy sauce.\r","Next add the beef to wok and stir-fry"],"picture":"https://www.themealdb.com/images/media/meals/1529444830.jpg","tags":[]},{"id":52959,"name":"Baked salmon with fennel & tomatoes","category":"Seafood","region":"British","instructions":["Heat oven to 180C/fan 160C/gas 4. Trim the fronds from the fennel and set aside. Cut the fennel bulbs in half, then cut each half into 3 wedges. Cook in boiling salted water for 10 mins, then drain well. Chop the fennel fronds roughly, then mix with the parsley and lemon zest.\r","\r","Spread the drained fennel over a shallow ovenproof dish, then add the tomatoes. Drizzle with olive oil, then bake for 10 mins. Nestle the salmon among the veg, sprinkle with lemon juice, then bake 15 mins more until the fish is just cooked. Scatter over the parsley and serve."],"picture":"https://www.themealdb.com/images/media/meals/1548772327.jpg","tags":["Paleo","Keto","HighFat","Baking","LowCarbs"]},{"id":52961,"name":"Budino Di Ricotta","category":"Dessert","region":"Italian","instructions":["Mash the ricotta and beat well with the egg yolks, stir in the flour, sugar, cinnamon, grated lemon rind and the rum and mix well. You can do this in a food processor. Beat the egg whites until stiff, fold in and pour into a buttered and floured 25cm cake tin. Bake in the oven at 180ºC/160ºC fan/gas 4 for about 40 minutes, or until it is firm.\r","\r","Serve hot or cold dusted with icing sugar."],"picture":"https://www.themealdb.com/images/media/meals/1549542877.jpg","tags":["Cake","Baking","Desert","Sweet","Alcoholic","Calorific"]},{"id":52965,"name":"Breakfast Potatoes","category":"Breakfast","region":"Canadian","instructions":["Before you do anything, freeze your bacon slices that way when you're ready to prep, it'll be so much easier to chop!\r","Wash the potatoes and cut medium dice into square pieces. To prevent any browning, place the already cut potatoes in a bowl filled with water.\r","In the meantime, heat 1-2 tablespoons of oil in a large skillet over medium-high heat. Tilt the skillet so the oil spreads evenly.\r","Once the oil is hot, drain the potatoes and add to the skillet. Season with salt, pepper, and Old Bay as needed.\r","Cook for 10 minutes, stirring the potatoes often, until brown. If needed, add a tablespoon more of oil.\r","Chop up the bacon and add to the potatoes. The bacon will start to render and the fat will begin to further cook the potatoes. Toss it up a bit! The bacon will take 5-6 minutes to crisp.\r","Once the bacon is cooked, reduce the heat to medium-low, add the minced garlic and toss. Season once more. Add dried or fresh parsley. Control heat as needed.\r","Let the garlic cook until fragrant, about one minute.\r","Just before serving, drizzle over the maple syrup and toss. Let that cook another minute, giving the potatoes a caramelized effect.\r","Serve in a warm bowl with a sunny side up egg!"],"picture":"https://www.themealdb.com/images/media/meals/1550441882.jpg","tags":["Breakfast","Brunch",""]},{"id":52979,"name":"Bitterballen (Dutch meatballs)","category":"Beef","region":"Dutch","instructions":["Melt the butter in a skillet or pan. When melted, add the flour little by little and stir into a thick paste. Slowly stir in the stock, making sure the roux absorbs the liquid. Simmer for a couple of minutes on a low heat while you stir in the onion, parsley and the shredded meat. The mixture should thicken and turn into a heavy, thick sauce.\r","\r","Pour the mixture into a shallow container, cover and refrigerate for several hours, or until the sauce has solidified.\r","\r","Take a heaping tablespoon of the cold, thick sauce and quickly roll it into a small ball. Roll lightly through the flour, then the egg and finally the breadcrumbs. Make sure that the egg covers the whole surface of the bitterbal. When done, refrigerate the snacks while the oil in your fryer heats up to 190C (375F). Fry four bitterballen at a time, until golden.\r","\r","Serve on a plate with a nice grainy or spicy mustard. \r",""],"picture":"https://www.themealdb.com/images/media/meals/lhqev81565090111.jpg","tags":["DinnerParty","HangoverFood","Alcoholic"]},{"id":52995,"name":"BBQ Pork Sloppy Joes","category":"Pork","region":"American","instructions":["1\r","\r","Preheat oven to 450 degrees. Wash and dry all produce. Cut sweet potatoes into ½-inch-thick wedges. Toss on a baking sheet with a drizzle of oil, salt, and pepper. Roast until browned and tender, 20-25 minutes.\r","\r","2\r","\r","Meanwhile, halve and peel onion. Slice as thinly as possible until you have ¼ cup (½ cup for 4 servings); finely chop remaining onion. Peel and finely chop garlic. Halve lime; squeeze juice into a small bowl. Halve buns. Add 1 TBSP butter (2 TBSP for 4) to a separate small microwave-safe bowl; microwave until melted, 30 seconds. Brush onto cut sides of buns.\r","\r","3\r","\r","To bowl with lime juice, add sliced onion, ¼ tsp sugar (½ tsp for 4 servings), and a pinch of salt. Stir to combine; set aside to quick-pickle.\r","\r","4\r","\r","Heat a drizzle of oil in a large pan over medium-high heat. Add chopped onion and season with salt and pepper. Cook, stirring, until softened, 4-5 minutes. Add garlic and cook until fragrant, 30 seconds more. Add pork and season with salt and pepper. Cook, breaking up meat into pieces, until browned and cooked through, 4-6 minutes.\r","\r","5\r","\r","While pork cooks, in a third small bowl, combine BBQ sauce, pickling liquid from onion, 3 TBSP ketchup (6 TBSP for 4 servings), ½ tsp sugar (1 tsp for 4), and ¼ cup water (⅓ cup for 4). Once pork is cooked through, add BBQ sauce mixture to pan. Cook, stirring, until sauce is thickened, 2-3 minutes. Taste and season with salt and pepper.\r","\r","6\r","\r","Meanwhile, toast buns in oven or toaster oven until golden, 3-5 minutes. Divide toasted buns between plates and fill with as much BBQ pork as you’d like. Top with pickled onion and hot sauce. Serve with sweet potato wedges on the side."],"picture":"https://www.themealdb.com/images/media/meals/atd5sh1583188467.jpg","tags":[]},{"id":52997,"name":"Beef Banh Mi Bowls with Sriracha Mayo, Carrot & Pickled Cucumber","category":"Beef","region":"Vietnamese","instructions":["Add'l ingredients: mayonnaise, siracha\r","\r","1\r","\r","Place rice in a fine-mesh sieve and rinse until water runs clear. Add to a small pot with 1 cup water (2 cups for 4 servings) and a pinch of salt. Bring to a boil, then cover and reduce heat to low. Cook until rice is tender, 15 minutes. Keep covered off heat for at least 10 minutes or until ready to serve.\r","\r","2\r","\r","Meanwhile, wash and dry all produce. Peel and finely chop garlic. Zest and quarter lime (for 4 servings, zest 1 lime and quarter both). Trim and halve cucumber lengthwise; thinly slice crosswise into half-moons. Halve, peel, and medium dice onion. Trim, peel, and grate carrot.\r","\r","3\r","\r","In a medium bowl, combine cucumber, juice from half the lime, ¼ tsp sugar (½ tsp for 4 servings), and a pinch of salt. In a small bowl, combine mayonnaise, a pinch of garlic, a squeeze of lime juice, and as much sriracha as you’d like. Season with salt and pepper.\r","\r","4\r","\r","Heat a drizzle of oil in a large pan over medium-high heat. Add onion and cook, stirring, until softened, 4-5 minutes. Add beef, remaining garlic, and 2 tsp sugar (4 tsp for 4 servings). Cook, breaking up meat into pieces, until beef is browned and cooked through, 4-5 minutes. Stir in soy sauce. Turn off heat; taste and season with salt and pepper.\r","\r","5\r","\r","Fluff rice with a fork; stir in lime zest and 1 TBSP butter. Divide rice between bowls. Arrange beef, grated carrot, and pickled cucumber on top. Top with a squeeze of lime juice. Drizzle with sriracha mayo."],"picture":"https://www.themealdb.com/images/media/meals/z0ageb1583189517.jpg","tags":[]},{"id":53013,"name":"Big Mac","category":"Beef","region":"American","instructions":["For the Big Mac sauce, combine all the ingredients in a bowl, season with salt and chill until ready to use.\r","2. To make the patties, season the mince with salt and pepper and form into 4 balls using about 1/3 cup mince each. Place each onto a square of baking paper and flatten to form into four x 15cm circles. Heat oil in a large frypan over high heat. In 2 batches, cook beef patties for 1-2 minutes each side until lightly charred and cooked through. Remove from heat and keep warm. Repeat with remaining two patties.\r","3. Carefully slice each burger bun into three acrossways, then lightly toast.\r","4. To assemble the burgers, spread a little Big Mac sauce over the bottom base. Top with some chopped onion, shredded lettuce, slice of cheese, beef patty and some pickle slices. Top with the middle bun layer, and spread with more Big Mac sauce, onion, lettuce, pickles, beef patty and then finish with more sauce. Top with burger lid to serve.\r","5. After waiting half an hour for your food to settle, go for a jog."],"picture":"https://www.themealdb.com/images/media/meals/urzj1d1587670726.jpg","tags":[]},{"id":53018,"name":"Bigos (Hunters Stew)","category":"Pork","region":"Polish","instructions":["Preheat the oven to 350 degrees F (175 degrees C).\r","\r","Heat a large pot over medium heat. Add the bacon and kielbasa; cook and stir until the bacon has rendered its fat and sausage is lightly browned. Use a slotted spoon to remove the meat and transfer to a large casserole or Dutch oven.\r","\r","Coat the cubes of pork lightly with flour and fry them in the bacon drippings over medium-high heat until golden brown. Use a slotted spoon to transfer the pork to the casserole. Add the garlic, onion, carrots, fresh mushrooms, cabbage and sauerkraut. Reduce heat to medium; cook and stir until the carrots are soft, about 10 minutes. Do not let the vegetables brown.\r","\r","Deglaze the pan by pouring in the red wine and stirring to loosen all of the bits of food and flour that are stuck to the bottom. Season with the bay leaf, basil, marjoram, paprika, salt, pepper, caraway seeds and cayenne pepper; cook for 1 minute.\r","\r","Mix in the dried mushrooms, hot pepper sauce, Worcestershire sauce, beef stock, tomato paste and tomatoes. Heat through just until boiling. Pour the vegetables and all of the liquid into the casserole dish with the meat. Cover with a lid.\r","\r","Bake in the preheated oven for 2 1/2 to 3 hours, until meat is very tender."],"picture":"https://www.themealdb.com/images/media/meals/md8w601593348504.jpg","tags":[]},{"id":53036,"name":"Boxty Breakfast","category":"Pork","region":"Irish","instructions":["STEP 1\r","Before you start, put your oven on its lowest setting, ready to keep things warm. Peel the potatoes, grate 2 of them, then set aside. Cut the other 2 into large chunks, then boil for 10-15 mins or until tender. Meanwhile, squeeze as much of the liquid from the grated potatoes as you can using a clean tea towel. Mash the boiled potatoes, then mix with the grated potato, spring onions and flour.\r","\r","STEP 2\r","Whisk the egg white in a large bowl until it holds soft peaks. Fold in the buttermilk, then add the bicarbonate of soda. Fold into the potato mix.\r","\r","STEP 3\r","Heat a large non-stick frying pan over a medium heat, then add 1 tbsp butter and some of the oil. Drop 3-4 spoonfuls of the potato mixture into the pan, then gently cook for 3-5 mins on each side until golden and crusty. Keep warm on a plate in the oven while you cook the next batch, adding more butter and oil to the pan before you do so. You will get 16 crumpet-size boxty from the mix. Can be made the day ahead, drained on kitchen paper, then reheated in a low oven for 20 mins.\r","\r","STEP 4\r","Heat the grill to medium and put the tomatoes in a heavy-based pan. Add a good knob of butter and a little oil, then fry for about 5 mins until softened. Grill the bacon, then pile onto a plate and keep warm. Stack up the boxty, bacon and egg, and serve the tomatoes on the side."],"picture":"https://www.themealdb.com/images/media/meals/naqyel1608588563.jpg","tags":[]},{"id":53053,"name":"Beef Rendang","category":"Beef","region":"Malaysian","instructions":["Chop the spice paste ingredients and then blend it in a food processor until fine.\r","Heat the oil in a stew pot, add the spice paste, cinnamon, cloves, star anise, and cardamom and stir-fry until aromatic. Add the beef and the pounded lemongrass and stir for 1 minute. Add the coconut milk, tamarind juice, water, and simmer on medium heat, stirring frequently until the meat is almost cooked. Add the kaffir lime leaves, kerisik (toasted coconut), sugar or palm sugar, stirring to blend well with the meat.\r","Lower the heat to low, cover the lid, and simmer for 1 to 1 1/2 hours or until the meat is really tender and the gravy has dried up. Add more salt and sugar to taste. Serve immediately with steamed rice and save some for overnight."],"picture":"https://www.themealdb.com/images/media/meals/bc8v651619789840.jpg","tags":[]},{"id":53060,"name":"Burek","category":"Side","region":"Croatian","instructions":["Fry the finely chopped onions and minced meat in oil. Add the salt and pepper. Grease a round baking tray and put a layer of pastry in it. Cover with a thin layer of filling and cover this with another layer of filo pastry which must be well coated in oil. Put another layer of filling and cover with pastry. When you have five or six layers, cover with filo pastry, bake at 200ºC/392ºF for half an hour and cut in quarters and serve."],"picture":"https://www.themealdb.com/images/media/meals/tkxquw1628771028.jpg","tags":["Streetfood"," Onthego"]},{"id":53068,"name":"Beef Mechado","category":"Beef","region":"Filipino","instructions":["0.\tMake the beef tenderloin marinade by combining soy sauce, vinegar, ginger, garlic, sesame oil, olive oil, sugar, salt, and ground black pepper in a large bowl. Mix well.\r","1.\tAdd the cubed beef tenderloin to the bowl with the beef tenderloin marinade. Gently toss to coat the beef. Let it stay for 1 hour.\r","2.\tUsing a metal or bamboo skewer, assemble the beef kebob by skewering the vegetables and marinated beef tenderloin.\r","3.\tHeat-up the grill and start grilling the beef kebobs for 3 minutes per side. This will give you a medium beef that is juicy and tender on the inside. Add more time if you want your beef well done, but it will be less tender.\r","4.\tTransfer to a serving plate. Serve with Saffron rice.\r","5.\tShare and enjoy!\r",""],"picture":"https://www.themealdb.com/images/media/meals/cgl60b1683206581.jpg","tags":["Stew"," Warming"]},{"id":53069,"name":"Bistek","category":"Beef","region":"Filipino","instructions":["0.\tMarinate beef in soy sauce, lemon (or calamansi), and ground black pepper for at least 1 hour. Note: marinate overnight for best result\r","1.\tHeat the cooking oil in a pan then pan-fry half of the onions until the texture becomes soft. Set aside\r","2.\tDrain the marinade from the beef. Set it aside. Pan-fry the beef on the same pan where the onions were fried for 1 minute per side. Remove from the pan. Set aside\r","3.\tAdd more oil if needed. Saute garlic and remaining raw onions until onion softens.\r","4.\tPour the remaining marinade and water. Bring to a boil.\r","5.\tAdd beef. Cover the pan and simmer until the meat is tender. Note: Add water as needed.\r","6.\tSeason with ground black pepper and salt as needed. Top with pan-fried onions.\r","7.\tTransfer to a serving plate. Serve hot. Share and Enjoy!\r",""],"picture":"https://www.themealdb.com/images/media/meals/4pqimk1683207418.jpg","tags":[]},{"id":53070,"name":"Beef Caldereta","category":"Beef","region":"Filipino","instructions":["0.\tHeat oil in a cooking pot. Saute onion and garlic until onion softens\r","1.\tAdd beef. Saute until the outer part turns light brown.\r","2.\tAdd soy sauce. Pour tomato sauce and water. Let boil.\r","3.\tAdd Knorr Beef Cube. Cover the pressure cooker. Cook for 30 minutes.\r","4.\tPan-fry carrot and potato until it browns. Set aside.\r","5.\tAdd chili pepper, liver spread and peanut butter. Stir.\r","6.\tAdd bell peppers, fried potato and carrot. Cover the pot. Continue cooking for 5 to 7 minutes.\r","7.\tSeason with salt and ground black pepper. Serve.\r",""],"picture":"https://www.themealdb.com/images/media/meals/41cxjh1683207682.jpg","tags":[]},{"id":53071,"name":"Beef Asado","category":"Beef","region":"Filipino","instructions":["0.\tCombine beef, crushed peppercorn, soy sauce, vinegar, dried bay leaves, lemon, and tomato sauce. Mix well. Marinate beef for at least 30 minutes.\r","1.\tPut the marinated beef in a cooking pot along with remaining marinade. Add water. Let boil.\r","2.\tAdd Knorr Beef Cube. Stir. Cover the pot and cook for 40 minutes in low heat.\r","3.\tTurn the beef over. Add tomato paste. Continue cooking until beef tenderizes. Set aside.\r","4.\tHeat oil in a pan. Fry the potato until it browns. Turn over and continue frying the opposite side. Remove from the pan and place on a clean plate. Do the same with the carrots.\r","5.\tSave 3 tablespoons of cooking oil from the pan where the potato was fried. Saute onion and garlic until onion softens.\r","6.\tPour-in the sauce from the beef stew. Let boil. Add the beef. Cook for 2 minutes.\r","7.\tAdd butter and let it melt. Continue cooking until the sauce reduces to half."],"picture":"https://www.themealdb.com/images/media/meals/pkopc31683207947.jpg","tags":[]},{"id":53076,"name":"Bread omelette","category":"Breakfast","region":"Indian","instructions":["Make and enjoy"],"picture":"https://www.themealdb.com/images/media/meals/hqaejl1695738653.jpg","tags":[]},{"id":53078,"name":"Beetroot Soup (Borscht)","category":"Vegetarian","region":"Russian","instructions":["Chop the beetroot, add water and stock cube and cook for 15mins. Add the other ingredients and boil until soft. Finally add the beans and cook for 5mins. Serve in the soup pot."],"picture":"https://www.themealdb.com/images/media/meals/zadvgb1699012544.jpg","tags":["soup"]},{"id":53080,"name":"Blini Pancakes","category":"Side","region":"Russian","instructions":["In a large bowl, whisk together 1/2 cup buckwheat flour, 2/3 cup all-purpose flour, 1/2 teaspoon salt, and 1 teaspoon yeast.\r","\r","Make a well in the center and pour in 1 cup warm milk, whisking until the batter is smooth.\r","\r","Cover the bowl and let the batter rise until doubled, about 1 hour.\r","\r","Enrich and Rest the Batter\r","Stir 2 tablespoons melted butter and 1 egg yolk into the batter.\r","\r","In a separate bowl, whisk 1 egg white until stiff, but not dry.\r","\r","Fold the whisked egg white into the batter.\r","\r","Cover the bowl and let the batter stand 20 minutes.\r","\r","Pan-Fry the Blini\r","Heat butter in a large nonstick skillet over medium heat.\r","\r","Drop quarter-sized dollops of batter into the pan, being careful not to overcrowd the pan. Cook for about 1 minute or until bubbles form.\r","\r","Turn and cook for about 30 additional seconds.\r","\r","Remove the finished blini onto a plate and cover them with a clean kitchen towel to keep warm. Add more butter to the pan and repeat the frying process with the remaining batter."],"picture":"https://www.themealdb.com/images/media/meals/0206h11699013358.jpg","tags":["pancake"]},{"id":52776,"name":"Chocolate Gateau","category":"Dessert","region":"French","instructions":["Preheat the oven to 180°C/350°F/Gas Mark 4. Grease and line the base of an 8 in round spring form cake tin with baking parchment\r","Break the chocolate into a heatproof bowl and place over a saucepan of gently simmering water and stir until it melts. (or melt in the microwave for 2-3 mins stirring occasionally)\r","Place the butter and sugar in a mixing bowl and cream together with a wooden spoon until light and fluffy. Gradually beat in the eggs, adding a little flour if the mixture begins to curdle. Fold in the remaining flour with the cooled, melted chocolate and milk. Mix until smooth.\r","Spread the mixture into the cake tin and bake for 50-55 mins or until firm in the centre and a skewer comes out cleanly. Cool for 10 minutes, then turn out and cool completely."],"picture":"https://www.themealdb.com/images/media/meals/tqtywx1468317395.jpg","tags":["Cake","Chocolate","Desert","Pudding"]},{"id":52765,"name":"Chicken Enchilada Casserole","category":"Chicken","region":"Mexican","instructions":["Cut each chicken breast in about 3 pieces, so that it cooks faster and put it in a small pot. Pour Enchilada sauce over it and cook covered on low to medium heat until chicken is cooked through, about 20 minutes. No water is needed, the chicken will cook in the Enchilada sauce. Make sure you stir occasionally so that it doesn't stick to the bottom.\r","Remove chicken from the pot and shred with two forks.\r","Preheat oven to 375 F degrees.\r","Start layering the casserole. Start with about ¼ cup of the leftover Enchilada sauce over the bottom of a baking dish. I used a longer baking dish, so that I can put 2 corn tortillas across. Place 2 tortillas on the bottom, top with ⅓ of the chicken and ⅓ of the remaining sauce. Sprinkle with ⅓ of the cheese and repeat starting with 2 more tortillas, then chicken, sauce, cheese. Repeat with last layer with the remaining ingredients, tortillas, chicken, sauce and cheese.\r","Bake for 20 to 30 minutes uncovered, until bubbly and cheese has melted and started to brown on top.\r","Serve warm."],"picture":"https://www.themealdb.com/images/media/meals/qtuwxu1468233098.jpg","tags":["Casserole","Cheasy","Meat"]},{"id":52779,"name":"Cream Cheese Tart","category":"Starter","region":"Unknown","instructions":["Crust: make a dough from 250g flour (I like mixing different flours like plain and wholegrain spelt flour), 125g butter, 1 egg and a pinch of salt, press it into a tart form and place it in the fridge. Filling: stir 300g cream cheese and 100ml milk until smooth, add in 3 eggs, 100g grated parmesan cheese and season with salt, pepper and nutmeg. Take the crust out of the fridge and prick the bottom with a fork. Pour in the filling and bake at 175 degrees C for about 25 minutes. Cover the tart with some aluminium foil after half the time. In the mean time, slice about 350g mini tomatoes. In a small pan heat 3tbsp olive oil, 3tbsp white vinegar, 1 tbsp honey, salt and pepper and combine well. Pour over the tomato slices and mix well. With a spoon, place the tomato slices on the tart, avoiding too much liquid on it. Decorate with basil leaves and enjoy"],"picture":"https://www.themealdb.com/images/media/meals/wurrux1468416624.jpg","tags":["Tart","Savory"]},{"id":52788,"name":"Christmas Pudding Flapjack","category":"Dessert","region":"British","instructions":["Preheat the oven to 180°C/fan 160°C/gas mark 4 and grease and line a 25cm x 20cm tin. Melt the butter, sugar, syrup and orange zest in a large saucepan over a medium heat. The aim is to dissolve all the ingredients so that they are smooth, but to not lose any volume through boiling so be careful not to overheat.\r","\r","Add the oats and stir well until evenly coated. Stir through the leftover Christmas pudding and tip into the prepared tin. Use a spoon to flatten the top and bake for 40 minutes until the edges start to brown. Whilst still warm in the tin, score into 12 squares. Allow to cool completely before cutting along the scores.\r","\r","Keeps for 5 days in an air tight tin or freeze for up to 1 month."],"picture":"https://www.themealdb.com/images/media/meals/vvusxs1483907034.jpg","tags":["Snack","Cake"]},{"id":52795,"name":"Chicken Handi","category":"Chicken","region":"Indian","instructions":["Take a large pot or wok, big enough to cook all the chicken, and heat the oil in it. Once the oil is hot, add sliced onion and fry them until deep golden brown. Then take them out on a plate and set aside.\r","To the same pot, add the chopped garlic and sauté for a minute. Then add the chopped tomatoes and cook until tomatoes turn soft. This would take about 5 minutes.\r","Then return the fried onion to the pot and stir. Add ginger paste and sauté well.\r","Now add the cumin seeds, half of the coriander seeds and chopped green chillies. Give them a quick stir.\r","Next goes in the spices – turmeric powder and red chilli powder. Sauté the spices well for couple of minutes.\r","Add the chicken pieces to the wok, season it with salt to taste and cook the chicken covered on medium-low heat until the chicken is almost cooked through. This would take about 15 minutes. Slowly sautéing the chicken will enhance the flavor, so do not expedite this step by putting it on high heat.\r","When the oil separates from the spices, add the beaten yogurt keeping the heat on lowest so that the yogurt doesn’t split. Sprinkle the remaining coriander seeds and add half of the dried fenugreek leaves. Mix well.\r","Finally add the cream and give a final mix to combine everything well.\r","Sprinkle the remaining kasuri methi and garam masala and serve the chicken handi hot with naan or rotis. Enjoy!"],"picture":"https://www.themealdb.com/images/media/meals/wyxwsp1486979827.jpg","tags":[]},{"id":52796,"name":"Chicken Alfredo Primavera","category":"Chicken","region":"Italian","instructions":["Heat 1 tablespoon of butter and 2 tablespoons of olive oil in a large skillet over medium-high heat. Season both sides of each chicken breast with seasoned salt and a pinch of pepper. Add the chicken to the skillet and cook for 5-7 minutes on each side, or until cooked through.  While the chicken is cooking, bring a large pot of water to a boil. Season the boiling water with a few generous pinches of kosher salt. Add the pasta and give it a stir. Cook, stirring occasionally, until al dente, about 12 minutes. Reserve 1/2 cup of  pasta water before draining the pasta.  Remove the chicken from the pan and transfer it to a cutting board; allow it to rest. Turn the heat down to medium and dd the remaining 1 tablespoon of butter and olive oil to the same pan you used to cook the chicken. Add the veggies (minus the garlic) and red pepper flakes to the pan and stir to coat with the oil and butter (refrain from seasoning with salt until the veggies are finished browning). Cook, stirring often, until the veggies are tender, about 5 minutes. Add the garlic and a generous pinch of salt and pepper to the pan and cook for 1 minute.  Deglaze the pan with the white wine. Continue to cook until the wine has reduced by half, about 3 minutes. Stir in the milk, heavy cream, and reserved pasta water. Bring the mixture to a gentle boil and allow to simmer and reduce for 2-3 minutes. Turn off the heat and add the Parmesan cheese and cooked pasta. Season with salt and pepper to taste. Garnish with Parmesan cheese and chopped parsley, if desired. "],"picture":"https://www.themealdb.com/images/media/meals/syqypv1486981727.jpg","tags":["Pasta","Meat","Dairy"]},{"id":52818,"name":"Chicken Fajita Mac and Cheese","category":"Chicken","region":"American","instructions":["Fry your onion, peppers and garlic in olive oil until nicely translucent. Make a well in your veg and add your chicken. Add your seasoning and salt. Allow to colour slightly.\r","Add your cream, stock and macaroni.\r","Cook on low for 20 minutes. Add your cheeses, stir to combine.\r","Top with roasted peppers and parsley."],"picture":"https://www.themealdb.com/images/media/meals/qrqywr1503066605.jpg","tags":["Pasta","Cheasy","Meat"]},{"id":52819,"name":"Cajun spiced fish tacos","category":"Seafood","region":"Mexican","instructions":["Cooking in a cajun spice and cayenne pepper marinade makes this fish super succulent and flavoursome. Top with a zesty dressing and serve in a tortilla for a quick, fuss-free main that's delightfully summery.\r","\r","On a large plate, mix the cajun spice and cayenne pepper with a little seasoning and use to coat the fish all over.\r","\r","Heat a little oil in a frying pan, add in the fish and cook over a medium heat until golden. Reduce the heat and continue frying until the fish is cooked through, about 10 minutes. Cook in batches if you don’t have enough room in the pan.\r","\r","Meanwhile, prepare the dressing by combining all the ingredients with a little seasoning.\r","Soften the tortillas by heating in the microwave for 5-10 seconds. Pile high with the avocado, lettuce and spring onion, add a spoonful of salsa, top with large flakes of fish and drizzle over the dressing."],"picture":"https://www.themealdb.com/images/media/meals/uvuyxu1503067369.jpg","tags":["Spicy","Fish"]},{"id":52830,"name":"Crock Pot Chicken Baked Tacos","category":"Chicken","region":"Mexican","instructions":["Put the uncooked chicken breasts in the crock pot. Pour the full bottle of salad dressing over the chicken. Sprinkle the rest of the ingredients over the top and mix them in a bit with a spoon.\r","Cover your crock pot with the lid and cook on high for 4 hours.\r","Remove all the chicken breasts from the crock pot and let cool.\r","Shred the chicken breasts and move to a glass bowl.\r","Pour most of the liquid over the shredded chicken.\r","FOR THE TACOS:\r","Make the guacamole sauce by mixing the avocado and green salsa together. Pour the guacamole mixture through a strainer until smooth and transfer to a squeeze bottle. Cut the tip off the lid of the squeeze bottle to make the opening more wide if needed.\r","Make the sour cream sauce by mixing the sour cream and milk together until you get a more liquid sour cream sauce. Transfer to a squeeze bottle.\r","In a 9x 13 glass baking dish, fill all 12+ tacos with a layer of refried beans, cooked chicken and shredded cheese.\r","Bake at 450 for 10-15 minutes just until the cheese is melted and bubbling.\r","Out of the oven top all the tacos with the sliced grape tomaotes, jalapeno and cilantro.\r","Finish with a drizzle of guacamole and sour cream.\r","Enjoy!"],"picture":"https://www.themealdb.com/images/media/meals/ypxvwv1505333929.jpg","tags":[]},{"id":52831,"name":"Chicken Karaage","category":"Chicken","region":"Japanese","instructions":["Add the ginger, garlic, soy sauce, sake and sugar to a bowl and whisk to combine. Add the chicken, then stir to coat evenly. Cover and refrigerate for at least 1 hour.\r","\r","Add 1 inch of vegetable oil to a heavy bottomed pot and heat until the oil reaches 360 degrees F. Line a wire rack with 2 sheets of paper towels and get your tongs out. Put the potato starch in a bowl\r","\r","Add a handful of chicken to the potato starch and toss to coat each piece evenly.\r","\r","Fry the karaage in batches until the exterior is a medium brown and the chicken is cooked through. Transfer the fried chicken to the paper towel lined rack. If you want the karaage to stay crispy longer, you can fry the chicken a second time, until it's a darker color after it's cooled off once. Serve with lemon wedges."],"picture":"https://www.themealdb.com/images/media/meals/tyywsw1505930373.jpg","tags":[]},{"id":52832,"name":"Coq au vin","category":"Chicken","region":"French","instructions":["Heat 1 tbsp of the oil in a large, heavy-based saucepan or flameproof dish. Tip in the bacon and fry until crisp. Remove and drain on kitchen paper. Add the shallots to the pan and fry, stirring or shaking the pan often, for 5-8 mins until well browned all over. Remove and set aside with the bacon.\r","Pat the chicken pieces dry with kitchen paper. Pour the remaining oil into the pan, then fry half the chicken pieces, turning regularly, for 5-8 mins until well browned. Remove, then repeat with the remaining chicken. Remove and set aside.\r","Scatter in the garlic and fry briefly, then, with the heat medium-high, pour in the brandy or Cognac, stirring the bottom of the pan to deglaze. The alcohol should sizzle and start to evaporate so there is not much left.\r","Return the chicken legs and thighs to the pan along with any juices, then pour in a little of the wine, stirring the bottom of the pan again. Stir in the rest of the wine, the stock and tomato purée, drop in the bouquet garni, season with pepper and a pinch of salt, then return the bacon and shallots to the pan. Cover, lower the heat to a gentle simmer, add the chicken breasts and cook for 50 mins-1hr.\r","Just before ready to serve, heat the oil for the mushrooms in a large non-stick frying pan. Add the mushrooms and fry over a high heat for a few mins until golden. Remove and keep warm.\r","Lift the chicken, shallots and bacon from the pan and transfer to a warmed serving dish. Remove the bouquet garni. To make the thickener, mix the flour, olive oil and butter in a small bowl using the back of a teaspoon. Bring the wine mixture to a gentle boil, then gradually drop in small pieces of the thickener, whisking each piece in using a wire whisk. Simmer for 1-2 mins. Scatter the mushrooms over the chicken, then pour over the wine sauce. Garnish with chopped parsley."],"picture":"https://www.themealdb.com/images/media/meals/qstyvs1505931190.jpg","tags":[]},{"id":52839,"name":"Chilli prawn linguine","category":"Pasta","region":"Italian","instructions":["Mix the dressing ingredients in a small bowl and season with salt and pepper. Set aside.\r","\r","Cook the pasta according to the packet instructions. Add the sugar snap peas for the last minute or so of cooking time.\r","\r","Meanwhile, heat the oil in a wok or large frying pan, toss in the garlic and chilli and cook over a fairly gentle heat for about 30 seconds without letting the garlic brown. Tip in the prawns and cook over a high heat, stirring frequently, for about 3 minutes until they turn pink.\r","\r","Add the tomatoes and cook, stirring occasionally, for 3 minutes until they just start to soften. Drain the pasta and sugar snaps well, then toss into the prawn mixture. Tear in the basil leaves, stir, and season with salt and pepper.\r","\r","Serve with salad leaves drizzled with the lime dressing, and warm crusty bread."],"picture":"https://www.themealdb.com/images/media/meals/usywpp1511189717.jpg","tags":[]},{"id":52840,"name":"Clam chowder","category":"Starter","region":"American","instructions":["Rinse the clams in several changes of cold water and drain well. Tip the clams into a large pan with 500ml of water. Cover, bring to the boil and simmer for 2 mins until the clams have just opened. Tip the contents of the pan into a colander over a bowl to catch the clam stock. When cool enough to handle, remove the clams from their shells – reserving a handful of empty shells for presentation if you want. Strain the clam stock into a jug, leaving any grit in the bottom of the bowl. You should have around 800ml stock.\r","Heat the butter in the same pan and sizzle the bacon for 3-4 mins until it starts to brown. Stir in the onion, thyme and bay and cook everything gently for 10 mins until the onion is soft and golden. Scatter over the flour and stir in to make a sandy paste, cook for 2 mins more, then gradually stir in the clam stock then the milk and the cream.\r","Throw in the potatoes, bring everything to a simmer and leave to bubble away gently for 10 mins or until the potatoes are cooked. Use a fork to crush a few of the potato chunks against the side of the pan to help thicken – you still want lots of defined chunks though. Stir through the clam meat and the few clam shells, if you've gone down that route, and simmer for a minute to reheat. Season with plenty of black pepper and a little salt, if needed, then stir through the parsley just before ladling into bowls or hollowed-out crusty rolls."],"picture":"https://www.themealdb.com/images/media/meals/rvtvuw1511190488.jpg","tags":[]},{"id":52841,"name":"Creamy Tomato Soup","category":"Starter","region":"British","instructions":["Put the oil, onions, celery, carrots, potatoes and bay leaves in a big casserole dish, or two saucepans. Fry gently until the onions are softened – about 10-15 mins. Fill the kettle and boil it.\r","Stir in the tomato purée, sugar, vinegar, chopped tomatoes and passata, then crumble in the stock cubes. Add 1 litre boiling water and bring to a simmer. Cover and simmer for 15 mins until the potato is tender, then remove the bay leaves. Purée with a stick blender (or ladle into a blender in batches) until very smooth. Season to taste and add a pinch more sugar if it needs it. The soup can now be cooled and chilled for up to 2 days, or frozen for up to 3 months.\r","To serve, reheat the soup, stirring in the milk – try not to let it boil. Serve in small bowls with cheesy sausage rolls."],"picture":"https://www.themealdb.com/images/media/meals/stpuws1511191310.jpg","tags":["Baking"]},{"id":52846,"name":"Chicken & mushroom Hotpot","category":"Chicken","region":"British","instructions":["Heat oven to 200C/180C fan/gas 6. Put the butter in a medium-size saucepan and place over a medium heat. Add the onion and leave to cook for 5 mins, stirring occasionally. Add the mushrooms to the saucepan with the onions.\r","\r","Once the onion and mushrooms are almost cooked, stir in the flour – this will make a thick paste called a roux. If you are using a stock cube, crumble the cube into the roux now and stir well. Put the roux over a low heat and stir continuously for 2 mins – this will cook the flour and stop the sauce from having a floury taste.\r","\r","Take the roux off the heat. Slowly add the fresh stock, if using, or pour in 500ml water if you’ve used a stock cube, stirring all the time. Once all the liquid has been added, season with pepper, a pinch of nutmeg and mustard powder. Put the saucepan back onto a medium heat and slowly bring it to the boil, stirring all the time. Once the sauce has thickened, place on a very low heat. Add the cooked chicken and vegetables to the sauce and stir well. Grease a medium-size ovenproof pie dish with a little butter and pour in the chicken and mushroom filling.\r","\r","Carefully lay the potatoes on top of the hot-pot filling, overlapping them slightly, almost like a pie top.\r","\r","Brush the potatoes with a little melted butter and cook in the oven for about 35 mins. The hot-pot is ready once the potatoes are cooked and golden brown."],"picture":"https://www.themealdb.com/images/media/meals/uuuspp1511297945.jpg","tags":[]},{"id":52850,"name":"Chicken Couscous","category":"Chicken","region":"Moroccan","instructions":["Heat the olive oil in a large frying pan and cook the onion for 1-2 mins just until softened. Add the chicken and fry for 7-10 mins until cooked through and the onions have turned golden. Grate over the ginger, stir through the harissa to coat everything and cook for 1 min more.\r","\r","Tip in the apricots, chickpeas and couscous, then pour over the stock and stir once. Cover with a lid or tightly cover the pan with foil and leave for about 5 mins until the couscous has soaked up all the stock and is soft. Fluff up the couscous with a fork and scatter over the coriander to serve. Serve with extra harissa, if you like."],"picture":"https://www.themealdb.com/images/media/meals/qxytrx1511304021.jpg","tags":[]},{"id":52853,"name":"Chocolate Avocado Mousse","category":"Dessert","region":"British","instructions":["1. Blend all the mousse ingredients together in your food processor until smooth. Add the cacao powder first and, as you blend, have all the ingredients to hand in order to adjust the ratios slightly as the size of avocados and bananas varies so much. The perfect ratio in order to avoid the dish tasting too much of either is to use equal amounts of both.\r","\r","2. Taste and add a few drops of stevia if you feel you need more sweetness.\r","\r","3. Fill little cups or shot glasses with the mousse, sprinkle with the cacao powder or nibs and serve.\r","\r","Tip If you don’t have a frozen banana to hand you can just use a normal one and then chill the mousse before serving for a cooling dessert."],"picture":"https://www.themealdb.com/images/media/meals/uttuxy1511382180.jpg","tags":[]},{"id":52856,"name":"Choc Chip Pecan Pie","category":"Dessert","region":"American","instructions":["First, make the pastry. Tip the ingredients into a food processor with 1 /4 tsp salt. Blend until the mixture resembles breadcrumbs. Drizzle 2-3 tsp cold water into the funnel while the blade is running – the mixture should start to clump together. Tip onto a work surface and bring together, kneading briefly into a ball. Pat into a disc, wrap in cling film, and chill for at least 20 mins. Heat oven to 200C/180C fan/gas 6.\r","\r","Remove the pastry from the fridge and leave at room temperature for 5 mins to soften. Flour the work surface, then unwrap the pastry and roll to a circle the thickness of a £1 coin. Use the pastry to line a deep, 23cm round fluted tin – mine was about 3cm deep. Press the pastry into the corners and up the sides, making sure there are no gaps. Leave 1cm pastry overhanging (save some of the pastry scraps for later). Line with baking parchment (scrunch it up first to make it more pliable) and fill with baking beans. Blind-bake for 15-20 mins until the sides are set, then remove the parchment and beans and return to the oven for 5 mins until golden brown. Trim the pastry so it’s flush with the top of the tin – a small serrated knife is best for this. If there are any cracks, patch them up with the pastry scraps.\r","\r","Meanwhile, weigh the butter, syrup and sugars into a pan, and add 1 /4 tsp salt. Heat until the butter has melted and the sugar dissolved, stirring until smooth. Remove from the heat and cool for 10 mins. Reduce oven to 160C/140C fan/gas 3.\r","\r","Beat the eggs in a bowl. Add the syrup mixture, vanilla and pecans, and mix until well combined. Pour half the mixture into the tart case, scatter over half the chocolate chips, then cover with the remaining filling and chocolate chips. Bake on the middle shelf for 50-55 mins until set. Remove from the oven and leave to cool, then chill for at least 2 hrs before serving."],"picture":"https://www.themealdb.com/images/media/meals/rqvwxt1511384809.jpg","tags":["Pie","Desert","Sweet","Nutty"]},{"id":52860,"name":"Chocolate Raspberry Brownies","category":"Dessert","region":"American","instructions":["Heat oven to 180C/160C fan/gas 4. Line a 20 x 30cm baking tray tin with baking parchment. Put the chocolate, butter and sugar in a pan and gently melt, stirring occasionally with a wooden spoon. Remove from the heat.\r","Stir the eggs, one by one, into the melted chocolate mixture. Sieve over the flour and cocoa, and stir in. Stir in half the raspberries, scrape into the tray, then scatter over the remaining raspberries. Bake on the middle shelf for 30 mins or, if you prefer a firmer texture, for 5 mins more. Cool before slicing into squares. Store in an airtight container for up to 3 days."],"picture":"https://www.themealdb.com/images/media/meals/yypvst1511386427.jpg","tags":["Chocolate","Desert","Snack"]},{"id":52870,"name":"Chickpea Fajitas","category":"Vegetarian","region":"Mexican","instructions":["Heat oven to 200C/180C fan/gas 6 and line a baking tray with foil. Drain the chickpeas, pat dry and tip onto the prepared baking tray. Add the oil and paprika, toss to coat, then roast for 20-25 mins until browned and crisp, shaking halfway through cooking.\r","\r","Meanwhile, put the tomatoes and onion in a small bowl with the vinegar and set aside to pickle. Put the avocado in another bowl and mash with a fork, leaving some larger chunks. Stir in the lime juice and season well. Mix the soured cream with the harissa and set aside until ready to serve.\r","\r","Heat a griddle pan until nearly smoking. Add the tortillas , one at a time, charring each side until hot with griddle lines. \r","\r","Put everything on the table and build the fajitas : spread a little of the harissa cream over the tortilla, top with roasted chickpeas, guacamole, pickled salsa and coriander, if you like. Serve with the lime wedges for squeezing over."],"picture":"https://www.themealdb.com/images/media/meals/tvtxpq1511464705.jpg","tags":["Vegetarian"]},{"id":52875,"name":"Chicken Ham and Leek Pie","category":"Chicken","region":"British","instructions":["Heat the chicken stock in a lidded saucepan. Add the chicken breast and bring to a low simmer. Cover with a lid and cook for 10 minutes. Remove the chicken breasts from the water with tongs and place on a plate. Pour the cooking liquor into a large jug.\r","Melt 25g/1oz of the butter in a large heavy-based saucepan over a low heat. Stir in the leeks and fry gently for two minutes, stirring occasionally until just softened. Add the garlic and cook for a further minute. Add the remaining butter and stir in the flour as soon as the butter has melted. Cook for 30 seconds, stirring constantly.\r","Slowly pour the milk into the pan, just a little at a time, stirring well between each adding. Gradually add 250ml/10fl oz of the reserved stock and the wine, if using, stirring until the sauce is smooth and thickened slightly. Bring to a gentle simmer and cook for 3 minutes.\r","Season the mixture, to taste, with salt and freshly ground black pepper. Remove from the heat and stir in the cream. Pour into a large bowl and cover the surface of the sauce with cling ilm to prevent a skin forming. Set aside to cool.\r","Preheat the oven to 200C/400F/Gas 6. Put a baking tray in the oven to heat.\r","For the pastry, put the flour and butter in a food processor and blend on the pulse setting until the mixture resembles fine breadcrumbs. With the motor running, add the beaten egg and water and blend until the mixture forms a ball. Portion off 250g/10oz of pastry for the lid.\r","Roll the remaining pastry out on a lightly floured surface, turning the pastry frequently until around 5mm/¼in thick and 4cm/1½in larger than the pie dish. Lift the pastry over the rolling pin and place it gently into the pie dish. Press the pastry firmly up the sides, making sure there are no air bubbles. Leave the excess pastry overhanging the sides.\r","Cut the chicken breasts into 3cm/1¼in pieces. Stir the chicken, ham and leeks into the cooled sauce. Pour the chicken filling into the pie dish. Brush the rim of the dish with beaten egg. Roll out the reserved pastry for the lid.\r","Cover the pie with the pastry lid and press the edges together firmly to seal. Trim any excess pastry.\r","Make a small hole in the centre of the pie with the tip of a knife. Glaze the top of the pie with beaten egg. Bake on the preheated tray in the centre of the oven for 35-40 minutes or until the pie is golden-brown all over and the filling is piping hot."],"picture":"https://www.themealdb.com/images/media/meals/xrrtss1511555269.jpg","tags":["Pie","Meat"]},{"id":52879,"name":"Chicken Parmentier","category":"Chicken","region":"French","instructions":["For the topping, boil the potatoes in salted water until tender. Drain and push through a potato ricer, or mash thoroughly. Stir in the butter, cream and egg yolks. Season and set aside.\r","For the filling, melt the butter in a large pan. Add the shallots, carrots and celery and gently fry until soft, then add the garlic. Pour in the wine and cook for 1 minute. Stir in the tomato purée, chopped tomatoes and stock and cook for 10–15 minutes, until thickened. Add the shredded chicken, olives and parsley. Season to taste with salt and pepper.\r","Preheat the oven to 180C/160C Fan/Gas 4.\r","Put the filling in a 20x30cm/8x12in ovenproof dish and top with the mashed potato. Grate over the Gruyère. Bake for 30–35 minutes, until piping hot and the potato is golden-brown."],"picture":"https://www.themealdb.com/images/media/meals/uwvxpv1511557015.jpg","tags":["Meat","Dairy"]},{"id":52897,"name":"Carrot Cake","category":"Dessert","region":"British","instructions":["For the carrot cake, preheat the oven to 160C/325F/Gas 3. Grease and line a 26cm/10in springform cake tin.\r","Mix all of the ingredients for the carrot cake, except the carrots and walnuts, together in a bowl until well combined. Stir in the carrots and walnuts.\r","Spoon the mixture into the cake tin and bake for 1 hour 15 minutes, or until a skewer inserted into the middle comes out clean. Remove the cake from the oven and set aside to cool for 10 minutes, then carefully remove the cake from the tin and set aside to cool completely on a cooling rack.\r","Meanwhile, for the icing, beat the cream cheese, caster sugar and butter together in a bowl until fluffy. Spread the icing over the top of the cake with a palette knife."],"picture":"https://www.themealdb.com/images/media/meals/vrspxv1511722107.jpg","tags":["Cake","Treat","Sweet"]},{"id":52898,"name":"Chelsea Buns","category":"Dessert","region":"British","instructions":["Sift the flour and salt into a large bowl. Make a well in the middle and add the yeast.\r","Meanwhile, warm the milk and butter in a saucepan until the butter melts and the mixture is lukewarm.\r","Add the milk mixture and egg to the flour mixture and stir until the contents of the bowl come together as a soft dough. (You may need to add a little extra flour.)\r","Tip the dough onto a generously floured work surface. Knead for five minutes, adding more flour if necessary, until the dough is smooth and elastic and no longer feels sticky.\r","Lightly oil a bowl with a little of the vegetable oil. Place the dough into the bowl and turn until it is covered in the oil. Cover the bowl with cling film and set aside in a warm place for one hour, or until the dough has doubled in size.\r","Lightly grease a baking tray.\r","For the filling, knock the dough back to its original size and turn out onto a lightly floured work surface. Roll the dough out into a rectangle 0.5cm/¼in thick. Brush all over with the melted butter, then sprinkle over the brown sugar, cinnamon and dried fruit.\r","Roll the dough up into a tight cylinder , cut ten 4cm/1½in slice and place them onto a lightly greased baking sheet, leaving a little space between each slice. Cover with a tea towel and set aside to rise for 30 minutes.\r","Preheat oven to 190C/375F/Gas 5.\r","Bake the buns in the oven for 20-25 minutes, or until risen and golden-brown.\r","Meanwhile, for the glaze, heat the milk and sugar in a saucepan until boiling. Reduce the heat and simmer for 2-3 minutes.\r","Remove the buns from the oven and brush with the glaze, then set aside to cool on a wire rack."],"picture":"https://www.themealdb.com/images/media/meals/vqpwrv1511723001.jpg","tags":["Bun","Baking","Treat"]},{"id":52905,"name":"Chocolate Souffle","category":"Dessert","region":"French","instructions":["Heat oven to 220C/fan 200C/gas 7 and place a baking tray on the top shelf. For the sauce, heat the cream and sugar until boiling. Remove from the heat, stir in the chocolate and butter until melted, then keep warm.\r","Brush 6 x 150ml ramekins with melted butter, sprinkle with the 2 tbsp caster sugar, then tip out any excess. Melt the chocolate and cream in a bowl over a pan of simmering water, cool, then mix in the egg yolks. Whisk the egg whites until they hold their shape, then add the sugar, 1 tbsp at a time, whisking back to the same consistency. Mix a spoonful into the chocolate, then gently fold in the rest.\r","Working quickly, fill the ramekins, wipe the rims clean and run your thumb around the edges. Turn oven down to 200C/fan 180C/gas 6, place the ramekins onto the baking tray, then bake for 8-10 mins until risen with a slight wobble. Don’t open the oven door too early as this may make them collapse.\r","Once the soufflés are ready, dust with icing sugar, scoop a small hole from their tops, then pour in some of the hot chocolate sauce. Replace the lids and serve straight away."],"picture":"https://www.themealdb.com/images/media/meals/twspvx1511784937.jpg","tags":["DinnerParty","Desert","Pudding","Chocolate"]},{"id":52910,"name":"Chinon Apple Tarts","category":"Dessert","region":"French","instructions":["To make the red wine jelly, put the red wine, jam sugar, star anise, clove, cinnamon stick, allspice, split vanilla pod and seeds in a medium saucepan. Stir together, then heat gently to dissolve the sugar. Turn up the heat and boil for 20 mins until reduced and syrupy. Strain into a small, sterilised jam jar and leave to cool completely. Will keep in the fridge for up to 1 month.\r","\r","Take the pastry out of the fridge and leave at room temperature for 10 mins, then unroll. Heat the grill to high and heat the oven to 180C/160C fan/gas 4. Cut out 2 x 13cm circles of pastry, using a plate as a guide, and place on a non-stick baking sheet. Sprinkle each circle with 1 tbsp sugar and grill for 5 mins to caramelise, watching carefully so that the sugar doesn’t burn. Remove from the grill. Can be done a few hours ahead, and left, covered, out of the fridge.\r","\r","Peel, quarter and core the apples, cut into 2mm-thin slices and arrange on top of the pastry. Sprinkle over the remaining sugar and pop in the oven for 20-25 mins until the pastry is cooked through and golden, and the apples are softened. Remove and allow to cool slightly. Warm 3 tbsp of the red wine jelly in a small pan over a low heat with 1 tsp water to make it a little more runny, then brush over the top of the tarts.\r","\r","Tip the crème fraîche into a bowl, sift over the icing sugar and cardamom, and mix together. Carefully lift the warm tarts onto serving plates and serve with the cardamom crème fraîche."],"picture":"https://www.themealdb.com/images/media/meals/qtqwwu1511792650.jpg","tags":["Tart","Baking"]},{"id":52920,"name":"Chicken Marengo","category":"Chicken","region":"French","instructions":["Heat the oil in a large flameproof casserole dish and stir-fry the mushrooms until they start to soften. Add the chicken legs and cook briefly on each side to colour them a little.\r","Pour in the passata, crumble in the stock cube and stir in the olives. Season with black pepper – you shouldn’t need salt. Cover and simmer for 40 mins until the chicken is tender. Sprinkle with parsley and serve with pasta and a salad, or mash and green veg, if you like."],"picture":"https://www.themealdb.com/images/media/meals/qpxvuq1511798906.jpg","tags":[]},{"id":52923,"name":"Canadian Butter Tarts","category":"Dessert","region":"Canadian","instructions":["Preheat the oven to fan 170C/ conventional 190C/gas 5. Roll out the pastry on a lightly floured surface so it’s slightly thinner than straight from the pack. Then cut out 18-20 rounds with a 7.5cm fluted cutter, re-rolling the trimmings. Use the rounds to line two deep 12-hole tart tins (not muffin tins). If you only have a regular-sized, 12-hole tart tin you will be able to make a few more slightly shallower tarts.\r","Beat the eggs in a large bowl and combine with the rest of the ingredients except the walnuts. Tip this mixture into a pan and stir continuously for 3-4 minutes until the butter melts, and the mixture bubbles and starts to thicken. It should be thick enough to coat the back of a wooden spoon. Don’t overcook, and be sure to stir all the time as the mixture can easily burn. Remove from the heat and stir in the nuts.\r","Spoon the filling into the unbaked tart shells so it’s level with the pastry. Bake for 15-18 minutes until set and pale golden. Leave in the tin to cool for a few minutes before lifting out on to a wire rack. Serve warm or cold."],"picture":"https://www.themealdb.com/images/media/meals/wpputp1511812960.jpg","tags":["Speciality","Snack","Desert","Pudding"]},{"id":52934,"name":"Chicken Basquaise","category":"Chicken","region":"French","instructions":["Preheat the oven to 180°C/Gas mark 4. Have the chicken joints ready to cook. Heat the butter and 3 tbsp olive oil in a flameproof casserole or large frying pan. Brown the chicken pieces in batches on both sides, seasoning them with salt and pepper as you go. Don't crowd the pan - fry the chicken in small batches, removing the pieces to kitchen paper as they are done.\r","\r","Add a little more olive oil to the casserole and fry the onions over a medium heat for 10 minutes, stirring frequently, until softened but not browned. Add the rest of the oil, then the peppers and cook for another 5 minutes.\r","\r","Add the chorizo, sun-dried tomatoes and garlic and cook for 2-3 minutes. Add the rice, stirring to ensure it is well coated in the oil. Stir in the tomato paste, paprika, bay leaves and chopped thyme. Pour in the stock and wine. When the liquid starts to bubble, turn the heat down to a gentle simmer. Press the rice down into the liquid if it isn't already submerged and place the chicken on top. Add the lemon wedges and olives around the chicken.\r","\r","Cover and cook in the oven for 50 minutes. The rice should be cooked but still have some bite, and the chicken should have juices that run clear when pierced in the thickest part with a knife. If not, cook for another 5 minutes and check again."],"picture":"https://www.themealdb.com/images/media/meals/wruvqv1511880994.jpg","tags":["Meat"]},{"id":52939,"name":"Callaloo Jamaican Style","category":"Miscellaneous","region":"Jamaican","instructions":["Cut leaves and soft stems from the kale branches, them soak in a bowl of cold water for about 5-10 minutes or until finish with prep.\r","Proceed to slicing the onions, mincing the garlic and dicing the tomatoes. Set aside\r","Remove kale from water cut in chunks.\r","Place bacon on saucepan and cook until crispy. Then add onions, garlic, thyme, stir for about a minute or more\r","Add tomatoes; scotch bonnet pepper, smoked paprika. Sauté for about 2-3 more minutes.\r","Finally add vegetable, salt, mix well, and steamed for about 6-8 minutes or until leaves are tender. Add a tiny bit of water as needed. Adjust seasonings and turn off the heat.\r","Using a sharp knife cut both ends off the plantain. This will make it easy to grab the skin of the plantains. Slit a shallow line down the long seam of the plantain; peel only as deep as the peel. Remove plantain peel by pulling it back.\r","Slice the plantain into medium size lengthwise slices and set aside.\r","Coat a large frying pan with cooking oil spray. Spray the tops of the plantains with a generous layer of oil spray and sprinkle with salt, freshly ground pepper.\r","Let the plantains \"fry\" on medium heat, shaking the frying pan to redistribute them every few minutes.\r","As the plantains brown, continue to add more cooking oil spray, salt and pepper (if needed) until they have reached the desired color and texture.\r","Remove and serve with kale"],"picture":"https://www.themealdb.com/images/media/meals/ussyxw1515364536.jpg","tags":["Savory"]},{"id":52956,"name":"Chicken Congee","category":"Chicken","region":"Chinese","instructions":["STEP 1 - MARINATING THE CHICKEN\r","In a bowl, add chicken, salt, white pepper, ginger juice and then mix it together well.\r","Set the chicken aside.\r","STEP 2 - RINSE THE WHITE RICE\r","Rinse the rice in a metal bowl or pot a couple times and then drain the water.\r","STEP 2 - BOILING THE WHITE RICE\r","Next add 8 cups of water and then set the stove on high heat until it is boiling. Once rice porridge starts to boil, set the stove on low heat and then stir it once every 8-10 minutes for around 20-25 minutes.\r","After 25 minutes, this is optional but you can add a little bit more water to make rice porridge to make it less thick or to your preference.\r","Next add the marinated chicken to the rice porridge and leave the stove on low heat for another 10 minutes.\r","After an additional 10 minutes add the green onions, sliced ginger, 1 pinch of salt, 1 pinch of white pepper and stir for 10 seconds.\r","Serve the rice porridge in a bowl\r","Optional: add Coriander on top of the rice porridge."],"picture":"https://www.themealdb.com/images/media/meals/1529446352.jpg","tags":[]},{"id":52966,"name":"Chocolate Caramel Crispy","category":"Dessert","region":"British","instructions":["Grease and line a 20 x 20cm/8\" x 8\" baking tin with parchment paper.\r","Put the mars bars and butter in a heat proof bowl and place over a pan of barely simmering water. Mixing with a whisk, melt until the mixture is smooth.\r","Pour over the rice krispies in a mixing bowl and mix until all the ingredients are evenly combined. Press evenly into the prepare baking tin and set aside.\r","Melt the milk chocolate in the microwave or over a pan of barely simmering water.\r","Spread the melted chocolate over the rice krispie mixture and leave to set in a cool place. Once set slice into squares and serve!"],"picture":"https://www.themealdb.com/images/media/meals/1550442508.jpg","tags":["Sweet","Snack","Treat","Tart","Alcoholic","BBQ"]},{"id":52969,"name":"Chakchouka ","category":"Miscellaneous","region":"Tunisian","instructions":["In a large cast iron skillet or sauté pan with a lid, heat oil over medium high heat. Add the onion and sauté for 2-3 minutes, until softened. Add the peppers and garlic, and sauté for an additional 3-5 minutes. Add the tomatoes, cumin, paprika, salt, and chili powder. Mix well and bring the mixture to a simmer. Reduce the heat to medium low and continue to simmer, uncovered, 10-15 minutes until the mixture has thickened to your desired consistency. (Taste the sauce at this point and adjust for salt and spice, as desired.) Using the back of a spoon, make four craters in the mixture, large enough to hold an egg. Crack one egg into each of the craters. Cover the skillet and simmer for 5-7 minutes, until the eggs have set. Serve immediately with crusty bread or pita."],"picture":"https://www.themealdb.com/images/media/meals/gpz67p1560458984.jpg","tags":[]},{"id":52976,"name":"Cashew Ghoriba Biscuits","category":"Dessert","region":"Tunisian","instructions":["Preheat the oven at 180 C / Gas 4. Line a baking tray with greaseproof paper.\r","In a bowl, mix the cashews and icing sugar. Add the egg yolks and orange blossom water and mix to a smooth homogeneous paste.\r","Take lumps of the cashew paste and shape into small balls. Roll the balls in icing sugar and transfer to the baking tray. Push an almond in the centre of each ghribia.\r","Bake until the biscuits are lightly golden, about 20 minutes. Keep an eye on them, they burn quickly."],"picture":"https://www.themealdb.com/images/media/meals/t3r3ka1560461972.jpg","tags":[]},{"id":52977,"name":"Corba","category":"Side","region":"Turkish","instructions":["Pick through your lentils for any foreign debris, rinse them 2 or 3 times, drain, and set aside.  Fair warning, this will probably turn your lentils into a solid block that you’ll have to break up later\r","In a large pot over medium-high heat, sauté the olive oil and the onion with a pinch of salt for about 3 minutes, then add the carrots and cook for another 3 minutes.\r","Add the tomato paste and stir it around for around 1 minute. Now add the cumin, paprika, mint, thyme, black pepper, and red pepper as quickly as you can and stir for 10 seconds to bloom the spices. Congratulate yourself on how amazing your house now smells.\r","Immediately add the lentils, water, broth, and salt. Bring the soup to a (gentle) boil.\r","After it has come to a boil, reduce heat to medium-low, cover the pot halfway, and cook for 15-20 minutes or until the lentils have fallen apart and the carrots are completely cooked.\r","After the soup has cooked and the lentils are tender, blend the soup either in a blender or simply use a hand blender to reach the consistency you desire. Taste for seasoning and add more salt if necessary.\r","Serve with crushed-up crackers, torn up bread, or something else to add some extra thickness.  You could also use a traditional thickener (like cornstarch or flour), but I prefer to add crackers for some texture and saltiness.  Makes great leftovers, stays good in the fridge for about a week."],"picture":"https://www.themealdb.com/images/media/meals/58oia61564916529.jpg","tags":["Soup"]},{"id":52989,"name":"Christmas Pudding Trifle","category":"Dessert","region":"British","instructions":["Peel the oranges using a sharp knife, ensuring all the pith is removed. Slice as thinly as possible and arrange over a dinner plate. Sprinkle with the demerara sugar followed by the Grand Marnier and set aside.\r","\r","Crumble the Christmas pudding into large pieces and scatter over the bottom of a trifle bowl. Lift the oranges onto the pudding in a layer and pour over any juices.\r","\r","Beat the mascarpone until smooth, then stir in the custard. Spoon the mixture over the top of the oranges.\r","\r","Lightly whip the cream and spoon over the custard. Sprinkle with the flaked almonds and grated chocolate. You can make this a day in advance if you like, chill until ready to serve."],"picture":"https://www.themealdb.com/images/media/meals/r33cud1576791081.jpg","tags":["Christmas"]},{"id":52988,"name":"Classic Christmas pudding","category":"Dessert","region":"British","instructions":["Get everything for the pudding prepared. Chop the almonds coarsely. Peel, core and chop the cooking apples. Sharpen your knife and chop the candied peel. (You can chop the almonds and apples in a food processor, but the peel must be done by hand.) Grate three quarters of the nutmeg (sounds a lot but it's correct).\r","\r","Mix the almonds, apples, candied peel, nutmeg, raisins, flour, breadcrumbs, light muscovado sugar, eggs and 2 tbsp brandy or cognac in a large bowl. \r","\r","Holding the butter in its wrapper, grate a quarter of it into the bowl, then stir everything together. Repeat until all the butter is grated, then stir for 3-4 mins – the mixture is ready when it subsides slightly after each stir. Ask the family to stir too, and get everyone to make a wish. \r","\r","Generously butter two 1.2 litre bowls and put a circle of baking parchment in the bottom of each. Pack in the pudding mixture. Cover with a double layer of baking parchment, pleating it to allow for expansion, then tie with string (keep the paper in place with a rubber band while tying). Trim off any excess paper. \r","\r","Now stand each bowl on a large sheet of foil and bring the edges up over the top, then put another sheet of foil over the top and bring it down underneath to make a double package (this makes the puddings watertight). Tie with more string, and make a handle for easy lifting in and out of the pan. Watch our video to see how to tie up a pudding correctly.\r","\r","Boil or oven steam the puddings for 8 hrs, topping up with water as necessary. Remove from the pans and leave to cool overnight. When cold, discard the messy wrappings and re-wrap in new baking parchment, foil and string. Store in a cool, dry place until Christmas. \r","\r","To make the brandy butter, cream the butter with the orange zest and icing sugar. Gradually beat in the brandy or cognac and chopped stem ginger. Put in a small bowl, fork the top attractively and put in the fridge to set. The butter will keep for a week in the fridge, or it can be frozen for up to six weeks. \r","\r","On Christmas Day, boil or oven steam for 1 hr. Unwrap and turn out. To flame, warm 3-4 tbsp brandy in a small pan, pour it over the pudding and set light to it."],"picture":"https://www.themealdb.com/images/media/meals/1d85821576790598.jpg","tags":["Christmas"]},{"id":52990,"name":"Christmas cake","category":"Dessert","region":"British","instructions":["Heat oven to 160C/fan 140C/gas 3. Line the base and sides of a 20 cm round, 7.5 cm deep cake tin. Beat the butter and sugar with an electric hand mixer for 1-2 mins until very creamy and pale in colour, scraping down the sides of the bowl half way through. Stir in a spoonful of the flour, then stir in the beaten egg and the rest of the flour alternately, a quarter at a time, beating well each time with a wooden spoon. Stir in the almonds.\r","\r","Mix in the sherry (the mix will look curdled), then add the peel, cherries, raisins, cherries, nuts, lemon zest, spice, rosewater and vanilla. Beat together to mix, then stir in the baking powder.\r","\r","Spoon mixture into the tin and smooth the top, making a slight dip in the centre. Bake for 30 mins, then lower temperature to 150C/fan 130C/gas 2 and bake a further 2-2¼ hrs, until a skewer insterted in the middle comes out clean. Leave to cool in the tin, then take out of the tin and peel off the lining paper. When completely cold, wrap well in cling film and foil to store until ready to decorate. The cake will keep for several months."],"picture":"https://www.themealdb.com/images/media/meals/ldnrm91576791881.jpg","tags":["Christmas"]},{"id":52998,"name":"Corned Beef and Cabbage","category":"Beef","region":"Irish","instructions":["1\r","\r","Place corned beef in large pot or Dutch oven and cover with water. Add the spice packet that came with the corned beef. Cover pot and bring to a boil, then reduce to a simmer. Simmer approximately 50 minutes per pound or until tender.\r","\r","2\r","\r","Add whole potatoes and peeled and cut carrots, and cook until the vegetables are almost tender. Add cabbage and cook for 15 more minutes. Remove meat and let rest 15 minutes.\r","\r","3\r","\r","Place vegetables in a bowl and cover. Add as much broth (cooking liquid reserved in the Dutch oven or large pot) as you want. Slice meat across the grain."],"picture":"https://www.themealdb.com/images/media/meals/xb97a81583266727.jpg","tags":[""]},{"id":52999,"name":"Crispy Sausages and Greens","category":"Pork","region":"Irish","instructions":["Preheat the oven to 350°. Remove the stems from one bunch of Tuscan kale and tear the leaves into 1\" pieces (mustard greens, collards, spinach, and chard are great, too). Coarsely chop half a head of green cabbage. Combine the greens in a large baking dish and add 4 cloves of thinly sliced garlic. Adding some sliced onions and shiitake mushrooms at this point is optional, but highly recommended (I'll sauté the onions and mushrooms in a cast iron baking dish right on the stove before adding to the greens). Coat the greens with some olive oil and pour ½ cup chicken stock or broth over everything. Cover the dish with foil and bake until the greens are wilted, about 15 minutes. Remove foil and season with salt and pepper. Continue to bake until cabbage is tender, about 20-25 minutes more.\r","\r","Meanwhile, heat a little olive oil in a large skillet over medium-high. Prick four sweet Italian sausages with a fork and cook until browned on all sides and cooked through, 10 to 12 minutes. When the greens are done, slice the sausage and toss into the greens with a splash of your favorite vinegar (I like sherry or red wine)."],"picture":"https://www.themealdb.com/images/media/meals/st1ifa1583267248.jpg","tags":[]},{"id":53011,"name":"Chicken Quinoa Greek Salad","category":"Chicken","region":"Greek","instructions":["Cook the quinoa following the pack instructions, then rinse in cold water and drain thoroughly.\r","\r","Meanwhile, mix the butter, chilli and garlic into a paste. Toss the chicken fillets in 2 tsp of the olive oil with some seasoning. Lay in a hot griddle pan and cook for 3-4 mins each side or until cooked through. Transfer to a plate, dot with the spicy butter and set aside to melt.\r","\r","Next, tip the tomatoes, olives, onion, feta and mint into a bowl. Toss in the cooked quinoa. Stir through the remaining olive oil, lemon juice and zest, and season well. Serve with the chicken fillets on top, drizzled with any buttery chicken juices."],"picture":"https://www.themealdb.com/images/media/meals/k29viq1585565980.jpg","tags":[]},{"id":53016,"name":"Chick-Fil-A Sandwich","category":"Chicken","region":"American","instructions":["Wrap the chicken loosely between plastic wrap and pound gently with the flat side of a meat tenderizer until about 1/2 inch thick all around.\r","Cut into two pieces, as even as possible.\r","Marinate in the pickle juice for 30 minutes to one hour (add a teaspoon of Tabasco sauce now for a spicy sandwich).\r","Beat the egg with the milk in a bowl.\r","Combine the flour, sugar, and spices in another bowl.\r","Dip the chicken pieces each into the egg on both sides, then coat in flour on both sides.\r","Heat the oil in a skillet (1/2 inch deep) to about 345-350.\r","Fry each cutlet for 2 minutes on each side, or until golden and cooked through.\r","Blot on paper and serve on toasted buns with pickle slices."],"picture":"https://www.themealdb.com/images/media/meals/sbx7n71587673021.jpg","tags":[]},{"id":53037,"name":"Coddled pork with cider","category":"Pork","region":"Irish","instructions":["STEP 1\r","Heat the butter in a casserole dish until sizzling, then fry the pork for 2-3 mins on each side until browned. Remove from the pan.\r","\r","STEP 2\r","Tip the bacon, carrot, potatoes and swede into the pan, then gently fry until slightly coloured. Stir in the cabbage, sit the chops back on top, add the bay leaf, then pour over the cider and stock. Cover the pan, then leave everything to gently simmer for 20 mins until the pork is cooked through and the vegetables are tender.\r","\r","STEP 3\r","Serve at the table spooned straight from the dish."],"picture":"https://www.themealdb.com/images/media/meals/7vpsfp1608588991.jpg","tags":[]},{"id":53055,"name":"Cevapi Sausages","category":"Beef","region":"Croatian","instructions":["Place the ground meat in a bowl. Chop the onion very finely and grate the garlic cloves. Add to the bowl. Add the chopped parsley, all sorts of paprika, baking soda, dried breadcrumbs, water, Vegeta, salt, and pepper.\r","Mix well with the hand mixer fitted with the dough hooks. Cover the bowl with cling film/ plastic foil and leave to rest for 1 or 2 hours in the refrigerator.\r","Take portions of the meat mixture, about 50-55 g/ 1.7-1.9 oz/ ¼ cup portions, and form the cevapi. The rolls should be about as thick as your thumb and about 7-10 cm/ 3-4 inches long. I had 18 sausages. The recipe can be easily doubled.\r","Grill the cevapcici on the hot grill pan or on the barbecue for about 12-14 minutes, turning them several times in between, or until brown and cooked through. I checked by cutting one in the middle and then grilling the following batches for the same period of time.\r","Serve hot as suggested above. The cevapcici can be reheated in the oven at 180 degrees Celsius/ 350 degrees Fahrenheit for about 10 minutes or until heated through. Check one, if it is not hot enough, give the sausages a few more minutes."],"picture":"https://www.themealdb.com/images/media/meals/vc08jn1628769553.jpg","tags":["Sausages"]},{"id":53056,"name":"Croatian lamb peka","category":"Beef","region":"Croatian","instructions":["Preheat oven to 200°C fan / 220°C / 425°F / Gas mark 7\r","If you have not bought diced lamb, cut your lamb shoulder or leg into large chunks and place to one side.\r","Chunks of chopped lamb of a red chopping board\r","Make oil marinade -\r","Mix 80ml of olive oil in a bowl with garlic puree, sundried tomato puree ,black pepper and salt.\r","olive oil, gia sundried tomato puree and gia garlic puree and black pepper mixed together in a silver bowl to make Croatian peka\r","Add potatoes and vegetables into a large lidded casserole dish.\r","Chopped up vegetables which consist of chopped up red onion, courgette, potatoes red peppers in a cast iron pan\r","Place diced lamb on top of the vegetables, pour the marinade and wine over the top.\r","Chunks of lamb covered in in a sundried tomato oil sauce which is on top of chopped red onion, aubergine, courgette and potatoes in a cast iron pan\r","Add the rosemary, thyme and sage, trying to keep the herbs on top.\r","So you can easily remove the herb stalks once cooked.\r","Chunks of lamb coated in a sundried tomato oil sauce and covered with thyme, rosemary and sage which is on top of chopped red onion, aubergine, courgette and potatoes in a cast iron pan\r","Place lid on the casserole dish and cook for 1hr 30 minute\r","If you do not have a lid cover very well with kitchen foil\r","Cast iron dish with lid on in the oven\r","Take the lid off, remove any thick herb stems. Stir in 2 tbsp of olive oil.\r","Cook for a further 20-30 mins.\r","Cooked Croatian Lamb Peka in a cast iron pan in the oven\r","Serve with fresh homemade bread to dip into the juices."],"picture":"https://www.themealdb.com/images/media/meals/pn59o51628769837.jpg","tags":[]},{"id":53058,"name":"Croatian Bean Stew","category":"Beef","region":"Croatian","instructions":["Heat the oil in a pan. Add the chopped vegetables and sauté until tender. Take a pot, empty the beans together with the vegetables into it, put the sausages inside and cook for further 20 minutes on a low heat. Or, put it in an oven and bake it at a temperature of 180ºC/350ºF for 30 minutes. This dish is even better reheated the next day."],"picture":"https://www.themealdb.com/images/media/meals/tnwy8m1628770384.jpg","tags":["Warming"," Soup"," Beans"]},{"id":53063,"name":"Chivito uruguayo","category":"Beef","region":"Unknown","instructions":["Crush the meat so that it is finite and we put it on a griddle to brown. Put the eggs, bacon and ham to fry.\r","Cut the bread in half, put the beef brisket, the fried eggs, the bacon, the ham, the mozzarella, the tomato and the lettuce. Cover with the other half of the bread and serve."],"picture":"https://www.themealdb.com/images/media/meals/n7qnkb1630444129.jpg","tags":[]},{"id":53072,"name":"Crispy Eggplant","category":"Vegetarian","region":"Filipino","instructions":["Slice eggplant into 1 cm (0.4-inch) slices. Place them in a bowl and sprinkle them with salt. allow them to sit for 30 minutes to render some of their liquid and bitterness.\r","2. After 30 minutes wash eggplant slices from salt and pat dry with a kitchen towel.\r","3. In a large bowl/plate place breadcrumbs and sesame seeds. In another bowl beat 2 eggs with pinch salt and pepper.\r","4. Heal oil in a large skillet over high heat.\r","5. Dip eggplant slices in egg, then in crumbs, and place in hot oil. Fry 2 to 3 minutes on each side, or until golden brown. Drain on a paper towel. \r",""],"picture":"https://www.themealdb.com/images/media/meals/c7lzrl1683208757.jpg","tags":[]},{"id":53077,"name":"Cabbage Soup (Shchi)","category":"Vegetarian","region":"Russian","instructions":["Add the butter to a large Dutch oven or other heavy-duty pot over medium heat. When the butter has melted, add the onion and sauté until translucent.\r","Add the cabbage, carrot, and celery. Sauté until the vegetables begin to soften, stirring frequently, about 3 minutes.\r","Add the bay leaf and vegetable stock and bring to a boil over high heat. Reduce the heat to low and simmer, covered, until the vegetables are crisp-tender, about 15 minutes.\r","Add the potatoes and bring it back to a boil over high heat. Reduce the heat to low and simmer, covered, until the potatoes are tender, about 10 minutes.\r","Add the tomatoes (or undrained canned tomatoes) and bring the soup back to a boil over high heat. Reduce the heat to low and simmer, uncovered, for 5 minutes. Season to taste with salt and pepper.\r","emove and discard the bay leaf from the pot.\r","Serve topped with fresh sour cream and fresh dill."],"picture":"https://www.themealdb.com/images/media/meals/60oc3k1699009846.jpg","tags":["soup"]}]}